{"english":[{"title":"Jesus Shall Take The Highest Honour","medlyFrom":0,"medlyTo":0,"href":"/english/1","content":"**Verse 1** Jesus shall take the highest honour Jesus shall take the highest praise Let all the earth join heav’n in exalting The name which is above all other names. **Verse 2** Let’s bow the knee in humble adoration For at His name every knee must bow Let every tongue confess He is Christ, God’s only Son Sovereign Lord, we give you glory now. **Chorus** For all honour and blessing and power Belongs to you, belongs to you. All honour and blessing and power. Belongs to you, belongs to you, Lord Jesus Christ, Son of the Living God. _(Chris Bowater)_"},{"title":"Jesus We Enthrone You","medlyFrom":0,"medlyTo":0,"href":"/english/2","content":"Jesus, we enthrone You, We proclaim you are King. Standing here in the midst of us; We raise You up with our praise. And as we worship, build Your throne. And as we worship, build Your throne. And as we worship, build Your throne. Come, Lord Jesus and take Your place. _(Don Moen)_"},{"title":"Who Shall Not Fear Your Name","medlyFrom":0,"medlyTo":0,"href":"/english/3","content":"**Verse 1** Who shall not fear Your name, O King? O Lord of all the earth? For this is Your rightful due. In all the kingdoms of the world, The name of Jesus stands alone For there is none like You! **Verse 2** Who shall not honour You, O King? O Lord of all the earth? For this is Your rightful due. In all the kingdoms of the world, The name of Jesus stands alone For there is none like You! **Verse 3** Who shall not worship You, O King? O Lord of all the earth? For this is Your rightful due. In all the kingdoms of the world, The name of Jesus stands alone For there is none like You! **Chorus** Who shall not fear Your Name? Who shall not honour You? Who shall not worship Christ - the King of Glory? Who shall not fear Your Name? Who shall not honour You? Who shall not worship Christ the Lord of all? **(Repeat Verse 1)** The name of Jesus stands alone For there is none like You! _(Oasis Worship)_"},{"title":"My Tribute (To God Be The Glory)","medlyFrom":0,"medlyTo":0,"href":"/english/4","content":"**Verse 1** How can I say thanks For the things You have done for me - Things so undeserved, Yet You give to prove Your love for me? The voices of a million angels Could not express my gratitude - All that I am and ever hope to be, I owe it all to Thee. **Refrain** To God be the glory, To God be the glory; To God be the glory For the things He has done. With His blood He has saved me; With His pow’r He has raised me; To God be the glory For the things He has done. **Verse 2** Just let me live my life; Let it be pleasing, Lord, to Thee. And should I gain any praise, Let it go to Calvary. **Refrain** With His blood He has saved me; With His pow’r He has raised me; To God be the glory For the things He has done _(Andraé Crouch / Ref: Psalm 115:1)_"},{"title":"I'm Gonna Praise God Unceasingly","medlyFrom":0,"medlyTo":0,"href":"/english/5","content":"**Verse 1** I'm gonna praise God unceasingly Because He lives in me, He's everything to me, Gives life continually. I'm gonna praise God unceasingly Because He lives in me, And He will never leave. **Chorus** Now in our spirit we can feed, Jesus Christ is all we need, Call His name and He becomes reality. Open up your mouth and you will see, Just how rich our Lord can be. He's the very life-supply, complete is He. **Verse 2** Now I live by the tree of life, His fruit does nourish me, O how it strengthens me, I'll live eternally. Now I live by the tree of life, Him daily I apply, He is my food supply. **Verse 3** There's a river of life in me, Flowing so livingly, Moving continually, He just keeps flooding me. There's a river of life in me, He's always filling me, His name is Jesus Christ!"},{"title":"Jesus, You're Alive!","medlyFrom":0,"medlyTo":0,"href":"/english/6","content":"**Verse 1** From the time I spoke Your name Lord, my life's not been the same Since I called on the only one who'd saved me. When forsaken, in despair - Who'd have thought that You'd be there! Now I've found out, Jesus, You're alive! All my friends might think it's square - Since I touch You I don't care - For I've found You're the only life worth living. Though some mock and criticize, Lord, they just don't realize, That I've found out, Jesus, You're alive! **Chorus** Now my eyes begin to see I'm living as I ought to be, As this turning, burning God moves in my heart I don't care now how I feel. I just know that this is real, And I know, Oh Jesus, You're alive! It's no statue that I call, Not a picture on the wall But a person who lives His life within me. Wish they'd told me long before All You want's an open door And that really, Jesus, You're alive! **(Repeat Chorus)** I don't care now how I feel. I just know that this is real, And I know, oh Jesus, You're alive!"},{"title":"Like Honey In The Rock","medlyFrom":0,"medlyTo":0,"href":"/english/7","content":"**Verse** He is my everything, He is my All. He is my everything, both great and small. He gave His Life for me, made everything new. He is my everything, now how about you? **Chorus** Like honey in the rock, Sweet honey in the rock, For He tastes like honey in the rock. Oh taste and see that the Lord is good, For He tastes like honey in the rock."},{"title":"I Just Keep Calling O Lord","medlyFrom":0,"medlyTo":0,"href":"/english/8","content":"**Verse** I just keep calling O Lord, as I walk along. I just keep calling O Lord, and He gives a song. Tho’ the storm clouds darken the sky o’er the heav’nly trail, I just keep calling O Lord, He will never fail! **Chorus** He’s a faithful Friend, such a faithful Friend. I can count on Him to the very end! Tho’ the storm-clouds darken the sky o’er the heav’nly trail, I just keep calling, O Lord, He will never fail!"},{"title":"From The Rising Of The Sun","medlyFrom":0,"medlyTo":0,"href":"/english/9","content":"**Verse** From the rising of the sun, to the going down of the same, the Lord's name is to be praised! **(Repeat Verse)** **Chorus** Praise ye the Lord! Praise ye all ye servants of the Lord! Praise the name of the Lord! Blessed be the name of the Lord, From this time forth, and forevermore!"},{"title":"O Lord, We're Just For Your Flowing!","medlyFrom":0,"medlyTo":0,"href":"/english/10","content":"**Verse 1** There's a life that's deeper than our mind With experience of man, yet so divine. It's a life that knows no bounds; And with glory is crowned; It's of depth and height and breadth unsearchable. Now this life is just the living one Manifested in the Person of the Son. As the Spirit, He flows; In our spirit He grows, Growing up to be the Church that He desires. **Chorus** O Lord, we're just for Your flowing; How we need a deeper knowing! Life is why we're here And why You've come in us. Turn us, Lord, turn us now; Turn us deeply - life is how You will get the Church, The home You're longing for. **Verse 2** In the Church, we all can apprehend All the riches of this life that is within. Not just shallowness with strife, But a deep and peaceful life, Is just waiting to flow out, a living spring. With the saints it's easy to be bold, To pursue this life, to gain it, to lay hold. All the other things we find, Must be quickly left behind, So that only life remains for us to see. **Verse 3** Deeper, Lord, our turn must be to You; We would move by life in everything we do: All our concept refute, For Your life be absolute - Grant us grace to turn much deeper day by day. When we touch our spirit - such a thrill! This is far beyond emotion, mind and will It's within our hidden part. Come, make home in all our heart; Let Your presence flow as rivers deep within."},{"title":"Christ The Real Life Giver","medlyFrom":0,"medlyTo":0,"href":"/english/11","content":"Christ the real life giver, Gives life to me, And every time I call on Him, His Spirit sets me free; Christ the real life giver, Lives now in me: No longer is He just a name, But my reality!"},{"title":"For Thou Oh Lord Art High Above","medlyFrom":0,"medlyTo":0,"href":"/english/12","content":"**Verse** For Thou, Lord, art high above all the earth. Thou art exalted far above all gods. For Thou, Lord, art high above all the earth. Thou art exalted far above all gods. **Chorus** I exalt Thee. I exalt Thee. I exalt Thee, O Lord. I exalt Thee. I exalt Thee. I exalt Thee, O Lord. _(Pete Sanchez Jr)_"},{"title":"Lord, Keep My Heart Always True To You","medlyFrom":0,"medlyTo":0,"href":"/english/13","content":"**Verse 1** Lord, keep my heart always true to You; Never backsliding, always viewing You; A heart that is pure, and sees only You; A heart that loves You, and treasures only You. **Chorus** Your love constrains me to give my all to You. Lord I can't help it, my heart is drawn to You; Oh what a privilege; I give myself to You! I love You, Lord, dearest Lord, I love You, I just love You. **Verse 2** Lord, keep my love burning brightly for You; A love never dwindling, always hot for You; A love shining brighter all the way for You; A love so fresh like the day I first touched You. **Verse 3** Lord, take my life, I present it to You; If I had a thousand I'd pour all on You; Nothing withholding, my all is for You; My life, and my future, dear Lord, is all for You. _(Howard Higashi)_"},{"title":"Calling, O Lord Jesus","medlyFrom":0,"medlyTo":0,"href":"/english/14","content":"Calling, \"O Lord Jesus!\" Oh, it makes our spirit strong! We can really touch Him, And our gloom is turn to song! Don't listen to Satan, with all his distraction; Just turn to your spirit, and spring into action! Calling, \"O Lord Jesus!\" You'll enjoy Him all day long!"},{"title":"God's Word Is A Lamp Unto My Feet","medlyFrom":0,"medlyTo":0,"href":"/english/15","content":"**Verse 1** God's word is a lamp unto my feet God's word is a light unto my path. God's word is a lamp unto my feet; God's word is a light unto my path. **Verse 2** God's word have I hidden in my heart. That I might not sin against my God. God's word have I hidden in my heart. That I might not sin against my God. **Verse 3** God's word is a shining, searching word; It shows me the secrets of my heart. God's word is a shining, searching word; It shows me the secrets of my heart. **Verse 4** God's word is eternal, strong and sure; God speaks and His word will come to pass. God's word is eternal, strong and sure; God speaks and His word will come to pass. **Verse 5** Faith comes from the hearing of God's word; His word is implanted in my heart. Faith comes from the hearing of God's word; His word is implanted in my heart. **Verse 6** God's word is the breathing out of God, To breath God's own nature into man. God's word is the breathing out of God, To breath God's own nature into man. **Verse 7** How sweet are God's word unto my taste, Yes, sweeter than honey to my mouth. How sweet are God's word unto my taste, Yes, sweeter than honey to my mouth. **Verse 8** God's word is the true and living word- The joy and rejoicing of my heart! God's word is the true and living word- The joy and rejoicing of my heart!"},{"title":"Jesus Take Me As I Am","medlyFrom":0,"medlyTo":0,"href":"/english/16","content":"Jesus take me as I am. I can come no other way. Take me deeper into You. Make my flesh life melt away. Make me like a precious stone, Crystal clear and finely honed, Life of Jesus shining through, Giving glory back to you. _(Dave Bryant)_"},{"title":"Blessed Be The Lord God","medlyFrom":0,"medlyTo":0,"href":"/english/17","content":"**Verse** Blessed be the Lord God, the God of Israel, Blessed be the Lord God, the God of Israel, Who only doeth wondrous things. Who only doeth wondrous things. And blessed be His glorious name forever. **Chorus** And let the whole earth be filled with His glory, Amen! Amen, Amen, and Amen. **(Repeat Verse)** _(Ref: Psalm 72:18-19 KJV)_"},{"title":"When'er I Call Lord Jesus","medlyFrom":0,"medlyTo":0,"href":"/english/18","content":"**Verse 1** When'er I call Lord Jesus Sure it sets my heart aglow; Just to feel His life arising That Christ in me may grow. Just call with us, \"Lord Jesus\" It's the greatest joy on earth! And then Christ will come into you, And you'll have another birth. **Verse 2** Just call with us, \"Lord Jesus\" He will surely set you free, If your heart is far, far from Him Whenever you may be. We simply call upon Him, No matter where we are. And calling thus, He enters, Oh, He's never very far. **Verse 3** Just call upon our Saviour, Sure He'll hear you every time. Lean your weary head upon Him And rest in sweet recline. For He is our strong fortress, Our peace, our joy, our rest. When we taste the grace of Jesus, Sure we're tasting the very best. **Verse 4** The best is just Himself now, And Himself He freely gave. So let's open up to Him now, And by His life be saved. And when He comes to meet us, As His bride we'll ready be. If today He grows within us, We shall then His glory see."},{"title":"Garment Of Praise","medlyFrom":0,"medlyTo":0,"href":"/english/19","content":"**Chorus** Put on the garment of praise For the spirit of heaviness. Lift up your voice to God. Praise with the spirit and with understanding. Oh, magnify the Lord. **Verse 1** All you that mourn in Zion, I have authority To appoint unto you in Zion Oil of joy that will set you free. **Verse 2** Lift up the hands that hang down. Lift up the voice now still. Give unto God continuous praise. Sing forth from Zion’s hill. **Verse 3** Sing to Yahweh, hallelujah. Worship and praise our God. Praise and adore Him. Bow down before Him. Oh, magnify the Lord. _(David Ingals)_"},{"title":"It's No Longer I That Liveth","medlyFrom":0,"medlyTo":0,"href":"/english/20","content":"It's no longer I that liveth But Christ that liveth in me It's no longer I that liveth But Christ that liveth in me He lives! He lives! Jesus is alive in me, It's no longer I that liveth, But Christ that liveth in me. _(Sally Ellis / Ref: Galatians 2:20)_"},{"title":"Lord, I Lift Your Name On High","medlyFrom":0,"medlyTo":0,"href":"/english/21","content":"**Verse** Lord, I lift Your name on high, Lord, I love to sing Your praises. I’m so glad You’re in my life, I’m so glad You came to save us. **Chorus** You came from heaven to earth To show the way, From the earth to the cross My debt to pay From the cross to the grave, From the grave to the sky; Lord, I lift Your name on high."},{"title":"Change My Heart, O God","medlyFrom":0,"medlyTo":0,"href":"/english/22","content":"**Verse** Change my heart, O God, Make it ever true; Change my heart, O God, May I be like You. **Chorus** You are the Potter, I am the clay; Mould me and make me, This is what I pray. **(Repeat Verse)** _(Eddie Espinosa / Ref: Psalm 51:10)_"},{"title":"In Eternity Past","medlyFrom":0,"medlyTo":0,"href":"/english/23","content":"**Verse 1** In eternity past, For His glorious purpose, God the Father elected us in His love. Thus the Gospel did come, At the time He appoints, To turn us to the Lord, From all idols we had. **Chorus 1** From darkness into light, From idols unto God, A true and living God, We are called to serve! **Verse 2** We are called to be saints, Through His life He imparts, Separating us from everything unto God. 'Tis His purpose to sanctify us to Himself, From our spirit to our entire being. **Chorus 2** To live a holy life Unto our Lord. Partaking of His life, Christ to express!"},{"title":"He Has Made Me Glad","medlyFrom":0,"medlyTo":0,"href":"/english/24","content":"**Verse** I will enter His gates with thanksgiving in my heart, I will enter His courts with praise. I will say this is the day that the Lord has made, I will rejoice for He has made me glad. **Chorus** He has made me glad, He has made me glad, I will rejoice for He has made me glad. _(Composer unknown / Ref: Psalms 100:4, 118:24)_"},{"title":"For His Anger Is But For A Moment","medlyFrom":0,"medlyTo":0,"href":"/english/25","content":"**Verse 1** I will extol Thee, O LORD, for Thou hast lifted me up, And hast not let my enemies rejoice over me. O LORD my God, I cried to Thee, I cried to Thee for help and Thou didst heal me. **Chorus** For His anger is but for a moment, His favor is for a lifetime; Weeping may last for the night, But a shout of joy comes in the morning. **Verse 2** O LORD, Thou hast brought up my soul from Sheol; Thou hast kept me alive, that I should not go down to the pit. Sing praise to the LORD you His godly ones, And give thanks, give thanks to His holy name. **(Repeat Chorus)** **Verse 3** Thou hast turned my mourning into dancing for me. Thou hast put off my sackcloth; Thou hast turned my mourning into dancing for me, And girded me with gladness; To the end my glory may sing praise unto Thee, And not be silent. O LORD my God, I will give thanks unto Thee forever. _(Ref: Psalm 30)_"},{"title":"A Chasing Of The Wind","medlyFrom":0,"medlyTo":0,"href":"/english/26","content":"**Verse 1** Every heart is filled with longing… To be free from all life’s pain. Yet the search through earthly pleasures Always ends in vain. Only God who made the heavens Can satisfy our souls… **Chorus** Apart from Him and all His meaning All things fail, as they begin. And hearts deceived, can only know A chasing of the wind. **Verse 2** All achievements, all possessions; All with time return to dust Only God can be our reason For deep and quiet trust He will guard us from the dangers That gladly make men fools... _(Ref: Ecclesiastics)_"},{"title":"Therefore Being Justified By Faith","medlyFrom":0,"medlyTo":0,"href":"/english/27","content":"**Verse 1** Therefore being justified by faith, We have peace with God, Through our Lord Jesus Christ - **Chorus** Because the love of God is shed abroad in our hearts by the Holy Spirit, Which is given, which is given, Unto us, to us, to us. **Verse 2** God had commended His love towards us, In that while we were sinners, Christ died for us - _(Ref: Romans 5:1)_"},{"title":"Because He Lives","medlyFrom":0,"medlyTo":0,"href":"/english/28","content":"**Verse 1** God sent His Son, they called Him Jesus, He came to love, heal and forgive; He lived and died, to buy my pardon, An empty grave is there to prove My Savior lives. **Chorus** Because He lives, I can face tomorrow, Because He lives, all fear is gone Because I know (I know) He holds the future And life is worth the living just because He lives. **Verse 2** The Son of God, He paid my ransom; Went to the cross, my sins to bear. No greater love! His life He laid down; He died for me and thus forever set me free. **Verse 3** Now I serve Him, my living Saviour; I walk with Him from day to day. He leads me on the heav’nly pathway; I know He keeps me in the shadow of His wings. _(Stanza 1 & Chorus by Gloria Gaither & William J. Gaithe / Ref: John 14:19) (Stanza 2 & 3 by S.H. Tow)_"},{"title":"Remember Him","medlyFrom":0,"medlyTo":0,"href":"/english/29","content":"**Verse** Remember, remember, Remember Him, Thy creator. Remember, remember Remember Him in Thy youth. **Chorus** While you are strong, And breath is in you. While you are at the brink of the fountain of youth... _(K.S. Lim / Ref: Ecclesiastes 12:1)_"},{"title":"I'm Singing For My Lord","medlyFrom":0,"medlyTo":0,"href":"/english/30","content":"**Verse 1** I’m singing for my Lord Everywhere I go, Singing of His wondrous love That the world may know How He saved a wretch like me By His death on Calvary - I’m singing for my Lord Everywhere I go. **Verse 2** I’m singing, but sometimes Heavy is the load For this world is not a friend To the grace of God; Yet I’ll sing the whole day long, For He fills my heart with song, I’m singing for my Lord Everywhere I go. **Verse 3** I’m singing for the lost Just because I know Jesus Christ, whose precious blood Washes white as snow; If my songs to Him can bring Some lost soul I’ll gladly sing - I’m singing for my Lord Everywhere I go. **Verse 4** I’m singing, for the saints As they journey home; Soon they’ll reach the happy land Where they’ll never roam, And with me they’ll join and sing Praises to our Lord and King - I’m singing for my Lord Everywhere I go. _(J. Smith & R. Harper)_"},{"title":"When I've Run The Race Before Me","medlyFrom":0,"medlyTo":0,"href":"/english/31","content":"**Verse 1** When I’ve run the race before me, And have fought to victory, I’ll be raptured to the glory of the Lord. When I’ve kept the faith at any cost The Holy city then; I’ll receive as my reward. **Chorus 1** I’ll be raptured into glory In the Holy City dwell – New Jerusalem, New Jerusalem. With the overcomers shouting; How our praises then will swell, In the New Jerusalem. **Verse 2** As a pilgrim here I wander; While afflicted, I rejoice; For a better land I soon expect to see. Though all others seek for earthly gain, The Holy City e’er Will my aspiration be. **Verse 3** Though my feet are often wearied On the rough and rugged path, Just by thinking of that City, I’m restored; Though my eyes be filled with tears, My heart will evermore be fixed On that City, my reward. **Verse 4** With strong purpose I now wrestle, And I run toward the goal; I pursue the prize, God’s highest to obtain; Pressing forward toward the mark, I run forgetting all behind, Thus the Holy City gain. (Chorus 2) **Chorus 2** By His love and through His grace I’ll In the Holy City live – New Jerusalem, New Jerusalem; All saints leaping, singing, shouting To the Lord their praises give, In the New Jerusalem."},{"title":"This World Is Not My Home","medlyFrom":0,"medlyTo":0,"href":"/english/32","content":"This world is not my home I’m just a-passing through My treasures are laid up Somewhere beyond the blue The angels beckon me from heaven’s open door And I can’t feel at home in this world any more. Oh Lord, You know I have no friend like You. If heaven’s not my home, then Lord, what will I do? The angels beckon me from heaven’s open door, And I can’t feel at home in this world anymore."},{"title":"I Know Who Holds Tomorrow","medlyFrom":0,"medlyTo":0,"href":"/english/33","content":"**Verse 1** I don’t know about tomorrow, I just live from day to day; I don’t borrow from its sunshine, For its skies may turn to gray; I don’t worry o’er the future, For I know what Jesus said, And today I’ll walk beside Him, For He knows what is ahead. **Chorus** Many things about tomorrow I don’t seem to understand; But I know who holds tomorrow, And I know who holds my hand. **Verse 2** I don’t know about tomorrow, It may bring me poverty; But the One who feeds the sparrow, Is the One who stands by me. And the path that be my portion, May be through the flame or flood, But His presence goes before me, And I’m covered with His blood. **Verse 3** Every step is getting brighter As the golden stairs I climb; Every burden’s getting lighter, Every cloud is silver lined. There the sun is always shining, There no tear will dim the eye; At the ending of the rainbow, Where the mountains touch the sky. _(Ira F. Stanphill)_"},{"title":"Unto Thee O Lord","medlyFrom":0,"medlyTo":0,"href":"/english/34","content":"**Verse 1** Unto Thee, O Lord, do I lift up my soul. (2x) **Chorus** O my God, I trust in Thee Let me not be ashamed, Let not my enemies triumph over me. **Verse 2** Yea, let none that wait, in Thee, be ashamed. (2x) **Verse 3** Show me Thy ways, teach me Thy paths. (2x) **Verse 4** Remember not the sins of my youth. (2x) **Verse 5** All the paths of the Lord are mercy and truth. (2x) **Verse 6** What man is he that feareth the Lord. (2x) **Verse 7** The secret of the Lord, is with them that fear Him. (2x) **Verse 8** Turn Thee unto me and have mercy upon me. (2x) _(Composer unknown/Ref: Psalm 25)_"},{"title":"He Cares For Me","medlyFrom":0,"medlyTo":0,"href":"/english/35","content":"**Verse 1** Our God is far greater than words can make known. Exalted and Holy, He reigns on His throne, In infinite splendor He rules over all. Yet He feeds the poor sparrows, and He knows when they fall. **Chorus** His power is great and will ever endure. His wisdom is peaceable, gentle and pure. But greater than all these glories I see, Is the glorious promise that He cares for me. **Verse 2** He rides the wild heavens, He strides to the sea. The high mountain trembles to hear His decree. His voice with great thundering sounds from above. But to His own dear children, He whispers His love _(Jimmy Owens)_"},{"title":"Jesus, Stand Among Us","medlyFrom":0,"medlyTo":0,"href":"/english/36","content":"**Verse 1** Jesus, stand among us at the meeting of our lives. Be our sweet agreement at the meeting of our eyes. **Chorus** O Jesus, we love You, so we gather here. Join our hearts in unity and take away our fear. **Verse 2** So to You we're gathering out of each and every land, Christ, the love between us at the joining of our hands. _(Graham Kendrick)_"},{"title":"Where Your Heart Is","medlyFrom":0,"medlyTo":0,"href":"/english/37","content":"**Chorus** I guess it all comes down to where your heart is. It's there your thoughts and feelings all begin, But if you never give your heart to Jesus, You'll never really have a part in Him. **Verse 1** If your treasures are in heaven, Then your heart will be there too, And the things you say and do Will show Christ's love. But if your treasures here on earth, Tell me where your heart will be, You'll never have a part in things above. **Verse 2** If your mind's set on the Spirit, And you're walking in God's light, Then the watching world will see Christ's love in you. But if your mind's set on the earth, And the earthly things to do, In poverty you'll live your whole life through. _(Jon Sherberg / Ref: Romans 8:5)_"},{"title":"I Worship You, Almighty God","medlyFrom":0,"medlyTo":0,"href":"/english/38","content":"I worship You, Almighty God, There is none like You. I worship You, O Prince of Peace, That is what I want to do. I give You praise, for You are my righteousness; I worship You, Almighty God, There is none like You. _(Sondra Corbett)_"},{"title":"You Are The King Of Glory","medlyFrom":0,"medlyTo":0,"href":"/english/39","content":"You are the Prince of Peace. You are the Lord of heaven and earth. You’re the Son of righteousness. Angels bow down before You, Worship and adore, for You have the words of eternal life. You are Jesus Christ, the Lord. Hosanna to the Son of David! Hosanna to the King of Kings! Glory in the highest heaven for Jesus, the Messiah reigns! _(Mavis Ford)_"},{"title":"Reach Out To Jesus","medlyFrom":0,"medlyTo":0,"href":"/english/40","content":"**Verse 1** Is your burden heavy as you bear it all alone? Does the road you travel Harbour danger yet unknown? Are you growing weary in the struggle of it all? Jesus will help you when on His name you call. **Chorus** He is always there, hearing every prayer, Faithful and true; Walking by our side, in His love we hide All the day through. When you get discouraged, Just remember what to do Reach out to Jesus, He's reaching out to you. **Verse 2** Is the life you're living filled with sorrow and despair? Does the future press you with its worries and its cares? Are you tired and friendless? Have you almost lost your way? Jesus will help you, just come to Him today. _(R. Carmichael)_"},{"title":"Thank You Lord","medlyFrom":0,"medlyTo":0,"href":"/english/41","content":"**Verse 1** I thank You, Lord, For the trials that come my way, In that way I can grow each day, As I let You lead; And I thank You Lord, For the patience those trials bring, In the process of growing, I can learn to care. **Chorus** But it goes against the way I am, To put my human nature down, And let the Spirit take control, of all I do; 'Cause when those trials come, My human nature shouts the things to do, And God's soft prompting can be easily ignored **Verse 2** But I thank You, Lord, With each trial I feel inside; That You're there to help, lead and guide Me away from wrong; 'Cause You’ve promised, Lord, That with every testing, That Your way of escaping is easier to bear. **Verse 3** Yes, I thank You, Lord, For the vict'ry that growing brings In surrender of everything, Life is so worthwhile; And I thank You, Lord, That when everything's put in place, Out in front I can see Your face And it's there You belong. _(Dan Burges)_"},{"title":"If You're Feeling Lonely With Many A Care","medlyFrom":0,"medlyTo":0,"href":"/english/42","content":"**Verse 1** If you're feeling lonely with many a care, Jesus, Jesus, Jesus is there! If trouble, confusion puts your life in night, Jesus, Jesus, Jesus is Light! **Chorus 1** If you turn to Him, From within, Burdens He'll share; It matters not who you are, Jesus is there. **Verse 2** So don't wait for answers from some place, somehow; Jesus, Jesus, Jesus is Now! **Chorus 2** If you call on Him, From within, You just can't miss! And when problems torment you, Just remember this: In all situations this world can afford, Jesus, Jesus, Jesus is Lord!"},{"title":"My Living Sacrifice","medlyFrom":0,"medlyTo":0,"href":"/english/43","content":"**Verse 1** My heart longs for You, my Saviour. I would follow You, my Lord. Your kindness and love are vast as the skies. Your faithfulness never dies. My God and my King, Your great name I sing. My off'ring of praise I bring. **Chorus** Jesus, O Jesus, I give You my life. Jesus, O Jesus, I give You my life. continue next page **Verse 2** My soul contemplates Your glory. I worship in holy awe. In quietness and in confident trust, I rest in all that You are. I'll sing to the world Your glory and grace Until I behold Your face. _(Leila Hamrat & Claude Fraysse)_"},{"title":"A Common Love For Each Other","medlyFrom":0,"medlyTo":0,"href":"/english/44","content":"**Chorus** A common love for each other, A common gift to the Savior, A common bond holding us to the Lord. A common strength when we’re weary, A common hope for tomorrow, A common joy in the truth of God’s Word. **Verse 1** In His family, we can meet each one’s needs, We can light each one’s path, We can bear each one’s grief. As His children, We can comfort each care, We can build each one’s faith, We can work, we can share. **Verse 2** In His family, all the love that we show, All the help that we give, All the life we bestow, As His children, They’re an off’ring we make, Not expecting return, Just a gift for His sake. _(C.F. Brown / Ref: Romans 12:4–16)_"},{"title":"Father, I Thank You","medlyFrom":0,"medlyTo":0,"href":"/english/45","content":"**Verse 1** Father, I thank You for all that You've done. You gave Your Son freely for me. And I praise You for calling me, drawing me near. Out of blindness You caused me to see. **Verse 2** Spirit of life, You are God's holy fire. You've kindled my heart with Your blaze. And I know You're refining me, changing my life. And by faith You're revealing Your ways. **Verse 3** Jesus, I need You as Lord of my life. I give all I have unto You. Lord, I want to come under Your heavenly hand, And to praise You in all that I do. _(Steven Stewart)_"},{"title":"Give Thanks","medlyFrom":0,"medlyTo":0,"href":"/english/46","content":"**Verse** Give thanks with a grateful heart. Give thanks to the Holy One. Give thanks because He’s given Jesus Christ, His Son. **(Repeat Verse)** **Chorus** And now let the weak say, “I am strong”, Let the poor say, “I am rich”, Because of what the Lord has done for us. And now let the weak say, “I am strong”, Let the poor say, “I am rich”, Because of what the Lord has done for us. Give thanks. _(Henry Smith)_"},{"title":"The Lily Of The Valley","medlyFrom":0,"medlyTo":0,"href":"/english/47","content":"**Verse 1** I’ve found a friend in Jesus, He’s everything to me, He’s the fairest of ten thousand to my soul; The Apple-tree of trees, in Him alone I see All I need to cleanse and make me fully whole. In sorrow He’s my comfort, In trouble He’s my stay, He tells me every care on Him to roll: He’s the Apple-tree of trees, The Bright and Morning Star, He’s the fairest of ten thousand to my soul. **Verse 2** He all my grief has taken, And all my sorrows borne; In temptation He’s my strong and mighty tower; I’ve all for Him forsaken, and all my idols torn From my heart, and now He keep me by His power. Though all the world forsake me, And Satan tempt me sore, Through Jesus I shall safely reach the goal: He’s the Apple-tree of trees, The Bright and Morning Star, He’s the fairest of ten thousand to my soul. **Verse 3** He’ll never, never leave me, nor yet forsake me here, While I live by faith and do His blessed will; A wall of fire about me, I’ve nothing now to fear, With His manna He my hungry soul shall fill. Then sweeping up to glory To see His blessed face, Where rivers of delight shall ever roll: He’s the Apple-tree of trees, The Bright and Morning Star, He’s the fairest of ten thousand to my soul."},{"title":"Step By Step","medlyFrom":0,"medlyTo":0,"href":"/english/48","content":"**Verse 1** ‘Tis so sweet to walk with Jesus, Step by step and day by day; Stepping in His very footprints, Walking with Him all the way. **Chorus** Step by step, step by step, I would walk with Jesus, All the day, all the way, Keeping step with Jesus. **Verse 2** ‘Tis so safe to walk with Jesus, Leaning hard upon His arm, Following closely where He leads us, None can hurt and naught can harm. **Verse 3** Step by step I’ll walk with Jesus, Just a moment at a time, Heights I have not wings to soar to, Step by step my feet can climb. **Verse 4** All the way I’ll walk with Jesus, Through the sunshine, through the gloom, Though His blood-marked steps may lead me To the garden, to the tomb. **Verse 5** Here a while we walk with Jesus, But the time will not be long Till the night shall change to morning, And the sorrow into song. **Verse 6** Then, with all who walked with Jesus, We shall walk with Him in white, While He turns our grief to gladness, And our darkness into light. **Verse 7** Jesus, keep me closer – closer, Step by step, and day by day; Stepping in Thy very footprints, Walking with Thee all the way. _(Albert B. Simpson)_"},{"title":"How Excellent Your Name","medlyFrom":0,"medlyTo":0,"href":"/english/49","content":"**Verse** Oh Lord, our Lord, How excellent Your name is. How excellent Your name in all the earth. Your glory fills the heavens beyond the furthest star. How excellent Your name in all the earth. **Chorus** When I think about the heavens, The moon and all the stars, I wonder what You ever saw in me; But You took me and You loved me, And You’ve given me a crown. And now I’ll praise Your name eternally. **(Repeat Verse)** _(Peter Jacobs / Ref: Psalm 8)_"},{"title":"He Is My Peace","medlyFrom":0,"medlyTo":0,"href":"/english/50","content":"**Verse** He is my peace, who has broken down every wall. He is my peace, He is my peace. He is my peace, who has broken down every wall. He is my peace, He is my peace. **Chorus** Cast all your care on Him, For He careth for you. He is my peace, He is my peace. Cast all your care on Him, For He careth for you. He is my peace, He is my peace. _(Kandy Groves/Ref: Ephesians 2:14; 1 Peter 5:7)_"},{"title":"The Power Of Your Love","medlyFrom":0,"medlyTo":0,"href":"/english/51","content":"**Verse 1** Lord I come to You Let my heart be changed, renewed Flowing from the grace That I’ve found in You. And Lord I’ve come to know The weaknesses I see in me Will be stripped away By the pow’r of Your love. **Chorus** Hold me close, Let Your love surround me. Bring me near, Draw me to Your side. And as I wait I’ll rise up like an eagle And I will soar with You, Your spirit leads me on In the pow’r of Your love. **Verse 2** Lord unveil my eyes, Let me see You face to face, The knowledge of Your love As You live in me. Lord renew my mind As Your will unfolds in my life In living every day By the pow’r of Your love. _(Geoff Bullock)_"},{"title":"We Choose The Fear Of The Lord","medlyFrom":0,"medlyTo":0,"href":"/english/52","content":"**Verse 1** We choose the fear of the Lord. **(2x)** For the fear of the Lord is to hate all evil, We choose the fear of the Lord. **Verse 2** We choose the way of the Lord. **(2x)** For the way of the Lord is the way of wisdom, We choose the way of the Lord. **Chorus** He who delights in the Word of the Lord Shall be blessed in all of his ways. For the friendship of God is with those who fear Him So we choose the fear of the Lord. We choose the way of the Lord. We choose the Word of the Lord. **Verse 3** We choose the Word of the Lord. **(2x)** For the Word of the Lord shall endure forever, We choose the Word of the Lord. **(Chorus)** **Finale** For the fear of the Lord is to hate all evil So we choose the fear of the Lord. We choose the way of the Lord. We choose the Word of the Lord. _(Kirk Dearman/Ref: Proverbs 9:10, 8:13; Isaiah 40:8)_"},{"title":"I'll Never Find A Friend So True","medlyFrom":0,"medlyTo":0,"href":"/english/53","content":"**Verse 1** There’s a new world somewhere We call the Promise Land, And I’ll be there someday, Since Jesus holds my hand. He is always there beside me In all things that I do, For I know I’ll never find a Friend so true. **Chorus** It’s a long, long journey so stay by my side. When I walk through the storm, Lord, be my Guide, be my Guide. If they gave me a fortune, My pleasure would be small. I could lose it all tomorrow, And never mind at all. But if I should lose my way Lord, You’ll show me what to do, For I know I’ll never find a Friend so true. **Verse 2** There is always Jesus To guide us on the way, And He’ll lead us someday, Where angels sing they say. If I should search the whole world over, Until life is through, I do know I’ll never find a Friend so true."},{"title":"Be It Unto Me","medlyFrom":0,"medlyTo":0,"href":"/english/54","content":"**Chorus** Be it unto me According to Your Word, According to Your promises, I can stand secure; Carve upon my heart The truth that sets me free, According to Your Word, O Lord, Be it unto me. **Verse 1** You promised Your blood will deliver, Lord, we believe it’s true; You’ve promised us joy like a river, Lord, we receive it from You. These things You have spoken and You’re bringing to pass; This world’s disappearing, But Your Word will last. So, ... **(Chorus)** **Verse 2** You promised to car-ry our sor-rows, Lord, we believe it’s true; You’ve promised unending tomorrows, Lord, we receive them from You. You’ll be our provider, In Your Word it’s revealed; By the stripes that you bore, Lord, We have been healed. So, ... **(Chorus)** _(By Don Moen and Claire Cloninger / Ref: Luke 1:38)_"},{"title":"Jesus Lord, I'm Captured By Thy Beauty","medlyFrom":0,"medlyTo":0,"href":"/english/55","content":"**Verse 1** Jesus Lord, I’m captured by Thy beauty, All my heart to Thee I open wide; Now set free from all religious duty, Only let me in Thyself abide. As I’m gazing here upon Thy glory, Fill my heart with radiancy divine; Saturate me, Lord, I now implore Thee, Mingle now Thy Spirit, Lord, with mine. **Verse 2** Shining One - how clear the sky above me! Son of Man, I see Thee on the throne! Holy One, the flames of God consume me, Till my being glows with Thee alone. Lord, when first I saw Thee in Thy splendor, All self-love and glory sank in shame; Now my heart its love and praises render, Tasting all the sweetness of Thy name. **Verse 3** Precious Lord, my flask of alabaster Gladly now I break in love for Thee; I anoint Thy head, Beloved Master; Lord, behold, I’ve saved the best for Thee. Dearest Lord, I waste myself upon Thee; Loving Thee, I’m deeply satisfied. Love outpoured from hidden depths within me, Costly oil, dear Lord, I would provide. **Verse 4** My Beloved, come on spices’ mountain; How I yearn to see Thee face to face. Drink, dear Lord, From my heart’s flowing fountain, Till I rest fore’er in Thine embrace. Not alone, O Lord, do I adore Thee, But with all the saints as Thy dear Bride; Quickly come, our love is waiting for Thee; Jesus Lord, Thou wilt be satisfied."},{"title":"Lord, Fill My Heart With Thy Grace","medlyFrom":0,"medlyTo":0,"href":"/english/56","content":"**Verse 1** Lord, fill my heart with Thy grace, ‘Cos You’re the only one who made my soul: Satisfied, filled with joy and quenched my thirst. Oh Lord, You are the only way. **Verse 2** Lord, keep me burning on and on, That my heart wouldn’t move away from Thee. Live within, Your great love and keep my all to You. ‘Cos Lord, You are the only way. **Verse 3** Lord, teach me how to follow Thee. That our light so shine before all men. That they see our good works and glorify Thee And Lord, You are my all in all. _(C.H. Pang 1997)_"},{"title":"God Will Make A Way","medlyFrom":0,"medlyTo":0,"href":"/english/57","content":"**Verse** God will make a way where there seems to be no way, He works in ways we cannot see, He will make a way for me; He will be my guide, hold me closely to His side, With love and strength for each new day, He will make a way, He will make a way. **Chorus** By a roadway in the wilderness He’ll lead me, And rivers in the desert will I see; Heaven and earth will fade But His Word will still remain, He will do something new today. **(Repeat Verse)** _(Don Moen / Ref: Isaiah 43:19)_"},{"title":"Once I Thirsted For A Fountain","medlyFrom":0,"medlyTo":0,"href":"/english/58","content":"**Verse 1** Once I thirsted for a fountain, Something deep that would satisfy, But the fountain that I’d drink from, Left me searching and still so dry. Then one day I found Him, He satisfied my thirst, Became in me a deeper source Whence living waters burst. Now I drink Him! Jesus, Jesus is my life now, Jesus, Jesus is my life; I’m fully satisfied now, Jesus, Jesus is my life. **Verse 2** After tasting such a fountain, Longed my heart for a place of springs; Caught a vision on a mountain, In Jerusalem’s a gathering. Then one day He found me, He brought me to the church, Pleasures here abound fore’er I’ve given up my search. Hallelujah! Jesus, Jesus is my life now, Jesus, Jesus is my life. I’m fully satisfied now, Jesus, Jesus is my life. **Verse 3** Empty wanderer drop the striving - Isn’t worth all the troublin’; Open up your heart believing, Call “Lord Jesus” and He’ll come in! Then today you’ll find Him, And calling on His name, You’re joined to Him, you’re one with Him - You’ll never be the same. You won’t want to! Jesus, Jesus is my life now, Jesus, Jesus is my life; I’m fully satisfied now, Jesus, Jesus is my life. _(Ref: John 4:5-15)_"},{"title":"Blessed Be The Lord God Almighty","medlyFrom":0,"medlyTo":0,"href":"/english/59","content":"Father in heaven, how we love You, We lift Your name in all the earth. May Your Kingdom be established in our praises As Your people declare Your mighty works. Blessed be the Lord God Almighty, Who was, and is and is to come. Blessed be the Lord God Almighty, Who reigns forevermore. _(Bob Fitts / Ref: Revelation 4:8b)_"},{"title":"Let Us Come Before His Presence With Thanksgiving","medlyFrom":0,"medlyTo":0,"href":"/english/60","content":"**Verse 1** O come, let us sing unto the Lord, Let us make a joyful noise To the rock of our salvation. O come, let us sing unto the Lord, Let us make a joyful noise To the rock of our salvation. **Chorus** Let us come before His presence with thanksgiving, And make a joyful noise unto Him with psalms. For the Lord is a great God, and a great King above all gods. **Verse 2** In His hands are the deep places of the earth: The strength of the hills is His also. The sea is His, and He made it: And His hands formed the dry land, And His hands formed the dry land. **Verse 3** O come, let us worship and bow down: Let us kneel before the Lord, the Lord our maker. For He is our God; And we are the people of His pasture, And the sheep of His hand. _(Composer unknown / Ref: Psalms 95:1-7)_"},{"title":"Here We Are, In Your Presence","medlyFrom":0,"medlyTo":0,"href":"/english/61","content":"Here we are, in Your presence; Lifting holy hands to You. Here we are, praising Jesus; For the things He’s brought us through. **(Repeat)** _(Tune: JL)_"},{"title":"You Are My All In All","medlyFrom":0,"medlyTo":0,"href":"/english/62","content":"**Verse 1** You are my strength when I am weak, You are the treasure that I seek, You are my All in All. Seeking you as a precious jewel, Lord to give up I'd be a fool, You are my all in all **Chorus** Jesus, Lamb of God, worthy is Your Name! Jesus, Lamb of God, worthy is Your Name! **Verse 2** Taking my sin, my cross, my shame, Rising again I bless Your name. You are my All in All. When I fall down, You pick me up; When I am dry, You fill my cup. You are my All in All. _(Dennis L. Jernigan / Ref: 2 Corinthians 12:9-10; Colossians 3:11)_"},{"title":"On Bended Knee I Come","medlyFrom":0,"medlyTo":0,"href":"/english/63","content":"**Verse 1** On bended knee I come, With a humble heart I come, Bowing down before Your holy throne. Lifting holy hands to You, As I pledge my love anew; I worship You in spirit, I worship You in truth, Make my life a holy praise unto You. **Verse 2** On bended knee we come, With a humble heart we come, Bowing down before Your holy throne. Lifting holy hands to You, As we pledge our love anew; We worship You in spirit, we worship You in truth, Make our lives a holy praise unto You."},{"title":"Amid The Trials Which I Meet","medlyFrom":0,"medlyTo":0,"href":"/english/64","content":"**Verse 1** Amid the trials that I meet, Amid the thorns that pierce my feet, One thought remains supremely sweet -- Thou thinkest, Lord, of me! **Chorus** Thou thinkest, Lord, of me! Thou thinkest, Lord, of me! What need I fear when Thou art near, And thinkest, Lord, of me! **Verse 2** The cares of life come thronging fast, Upon my soul their shadows cast; Their gloom reminds my heart at last Thou thinkest, Lord, of me! **Verse 3** Let shadows come, let shadows go, Let life be bright, or dark with woe, I am content, for this I know Thou thinkest, Lord, of me!"},{"title":"Thy Loving Kindness","medlyFrom":0,"medlyTo":0,"href":"/english/65","content":"Thy loving kindness is better than life **(2x)** My lips shall praise Thee, Thus will I bless Thee. Thy loving kindness is better than life. I will lift my hands up unto Thy name **(2x)** My lips shall praise Thee, Thus will I bless Thee. Thy loving kindness is better than life. _(Hugh Mitchell / Ref: Psalm 63:3,4)_"},{"title":"Trust In The Lord","medlyFrom":0,"medlyTo":0,"href":"/english/66","content":"**Verse 1** Trust in the Lord, and do not be discouraged, Trust in the Lord, and stop that feeling blue, Trust in the Lord and you will be encouraged, For Jesus cares for you. **Verse 2** Trust in the Lord, and not in any fable, Trust in the Lord, and find Him wholly true, Trust in the Lord, and know that He is able To fill your whole life through. **Verse 3** Trust in the Lord, and not in men or nation, Trust in the Lord, as Saviour, Lord and King, Trust in the Lord for full and free salvation, And lift your heart and sing. **Verse 4** Trust in the Lord, faith is a great adventure, Trust in the Lord, and never cease to pray, Trust in the Lord, for all the unknown future, Today and every day! _(R. McCurdy Jones)_"},{"title":"With My Lips I Will Bless You","medlyFrom":0,"medlyTo":0,"href":"/english/67","content":"With my lips I will bless You. With my mouth I’ll sing your praise. With my eyes I long to see You. Show me your face. With my ears I long to hear You. With my hands I long to touch You. With all my heart I surrender to You. Let all that is within me bless your holy name. Let all that is within me bless your holy name. _(David Campbell)_"},{"title":"I Do Not Know What Lies Ahead","medlyFrom":0,"medlyTo":0,"href":"/english/68","content":"**Verse 1** I do not know what lies ahead, The way I cannot see; Yet One stands near to be my guide, He’ll show the way to me **Chorus** I know who holds the future, And He’ll guide me with His hand, With God things don’t just happen, Everything by Him is planned; So as I face tomorrow With its problems large and small, I’ll trust the God of miracles, Give to Him my all. **Verse 2** I do not know how many days Of life are mine to spend; But One who knows and cares for me Will keep me to the end **Verse 3** I do not know the course ahead, What joys and grieves are there; But One is near who fully knows, I’ll trust His loving care _(A. B. Smith & E. Clark)_"},{"title":"Give Me Oil In My Lamp","medlyFrom":0,"medlyTo":0,"href":"/english/69","content":"### Version 1 Give me oil in my lamp, keep me burning, Give me oil in my lamp, I pray; Give me oil in my lamp, keep me burning, Keep me burning ‘til the break of day: **Chorus** Sing Hosanna! Sing Hosanna! Sing Hosanna to the King of Kings! Sing Hosanna! Sing Hosanna! Sing Hosanna to the King. **(One group sustain “Sing” while the other sings “Sing Hosanna” )** ### Version 2 **Verse 1**: Give me joy in my heart, keep me praising, **Verse 2**: Give me peace in my heart, keep me resting, **Verse 3**: Give me love in my heart, keep me serving, ### Version 3 **Verse 1** What a wonderful Saviour is Jesus, What a wonderful friend is He, For He left all the glory of heaven, Came to earth to die on Calvary: **(Chorus as version 1)** **Verse 2** He arose from the grave, Hallelujah, And He lives never more to die, At the Father’s right hand interceding, He will hear and heed our faintest cry: **(Chorus as version 1)** **Verse 3** He is coming some day to receive us, We’ll be caught up to heaven above, What a joy it will be to behold Him, Sing forever of His grace and love: **(Chorus as version 1)**"},{"title":"We Have Oil In Our Lamps - We Are Burning!","medlyFrom":0,"medlyTo":0,"href":"/english/70","content":"**Verse 1** We have oil in our lamps - we are burning! We have oil in our lamps today! To the spirit, O Lord, keep us turning, Keep us turning, turning all the way! O Lord! Amen! Hallelujah! We are burning, burning everyday! O Lord! Amen! Hallelujah! Turning, turning all the way. **Verse 2** But our vessels need oil for Thy coming; We must gain a reserve supply. So our vessels we give for the filling That our lamps may never, never die. Fill us, Jesus! Fill us, Jesus! Every moment give us more of Thee! Fill us, Jesus! Fill us, Jesus! Fill us with reality! **Verse 3** Then we’ll burn till the Lord comes to meet us, Then we’ll burn till He comes that day. Then we’ll go in with Him to the wedding And be brightly burning all the way. Come, Lord Jesus! Come, Lord Jesus! Come and find us filled and burning bright! Come, Lord Jesus! Come, Lord Jesus! Come and in Thy Bride delight. _(Ref: Matthew 25:1-13)_"},{"title":"Thy Word Is A Lamp Unto My Feet","medlyFrom":0,"medlyTo":0,"href":"/english/71","content":"**Chorus** Thy Word is a lamp unto my feet And a light unto my path. **(2x)** **Verse 1** When I feel afraid, think I’ve lost my way, Still You’re there right beside me. And nothing will I fear as long as You are near. Please be near me to the end. **Verse 2** I will not forget Your love for me, and yet My heart forever is wandering. Jesus be my guide and hold me to Your side, And I will love You to the end. _(Amy Grant & Michael Smith / Ref: Psalm 119:105)_"},{"title":"Seek Ye First The Kingdom Of God","medlyFrom":0,"medlyTo":0,"href":"/english/72","content":"**Verse 1** Seek ye first the Kingdom of God And His righteousness And all these things shall be added unto you Hallelu, Hallelujah. **Verse 2** Man shall not live by bread alone But by every word That proceeds from the mouth of God Hallelu, Hallelujah. **Verse 3** Ask and it shall be given unto you Seek and you shall find Knock and it shall be opened unto you Hallelu, Hallelujah _(Karen Laferty / Ref: Matthew 6:33; 7:7)_"},{"title":"Sing Hallelujah To The Lord","medlyFrom":0,"medlyTo":0,"href":"/english/73","content":"Sing Hallelujah to the Lord, Sing Hallelujah to the Lord, Sing Hallelujah, Sing Hallelujah; Sing Hallelujah to the Lord. _(Linda Stassen)_"},{"title":"You Are My Hiding Place","medlyFrom":0,"medlyTo":0,"href":"/english/74","content":"You are my hiding place, You always fill my heart with songs Of deliverance, Whenever I am afraid I will trust in You, I will trust in You, Let the weak say, “I am strong In the strength of the Lord.” **(Repeat, then sing last line)** I will trust in you.” _(Michael Ledner)_"},{"title":"Fill My Eyes","medlyFrom":0,"medlyTo":0,"href":"/english/75","content":"Fill my eyes, O my God, With the vision of the cross. Fill my heart with love for Jesus the Nazarene. Fill my mouth with Thy praise, Let me sing through endless days. Take my will, let my life be wholly Thine. _(K. Chant)_"},{"title":"Open Our Eyes","medlyFrom":0,"medlyTo":0,"href":"/english/76","content":"Open our eyes, Lord, We want to see Jesus, To reach out and touch Him, And say that we love Him. Open our ears, Lord, And help us to listen, Open our eyes, Lord, We want to see Jesus. _(Bob Cull)_"},{"title":"Alpha And Omega","medlyFrom":0,"medlyTo":0,"href":"/english/77","content":"**Verse 1** He is Alpha and Omega, The beginning and the end. He’s behind me, He’s before me, He’s ever my friend. Whatever I do, wherever I go Jesus is my source and my goal. **Verse 2** You are Alpha and Omega, The beginning and the end. You’re behind me, You’re before me, You’re ever my friend. Whatever I do, wherever I go, You are my source and my goal. _(Ane Warner & Sherry Saunders)_"},{"title":"Be Thou My Vision","medlyFrom":0,"medlyTo":0,"href":"/english/78","content":"**Verse 1** Be Thou my Vision, O Lord of my heart - Nought be all else to me, save that Thou art; Thou my best thought, by day or by night - Waking or sleeping, Thy presence my light. **Verse 2** Be Thou my Wisdom, and Thou my true Word – I ever with Thee and Thou with me, Lord; Thou my great Father, I Thy true son – Thou in me dwelling, and I with Thee one. **Verse 3** Riches I heed not, nor man’s empty praise – Thou mine inheritance, now and always; Thou and Thou only, first in my heart – High King of heaven, my Treasure Thou art. **Verse 4** High King of heaven, my victory won, May I reach heaven’s joys, O bright heav’n’s Sun! Heart of my own heart, whatever befall, Still be my Vision, O Ruler of all. _(Mary E. Byrne, Eleanor H. Hull, Irish hymn c. 8th century)_"},{"title":"Everybody Ought To Know","medlyFrom":0,"medlyTo":0,"href":"/english/79","content":"Everybody ought to know, Everybody ought to know, Everybody ought to know who Jesus is. He’s the lily of the valley, He’s the Bright and Morning Star, He’s the fairest of ten thousand Everybody ought to know. _(Source: Then Sings My Soul #98)_"},{"title":"Be Exalted, O God","medlyFrom":0,"medlyTo":0,"href":"/english/80","content":"**Verse** I will give thanks to Thee, O Lord, among the peoples. I will sing praises to Thee among the nations. For Thy steadfast love is great, Is great to the heavens, And Thy faithfulness, Thy faithfulness to the clouds. **Chorus** Be exalted, O God, Above the heavens, Let Thy glory be over all the earth. Be exalted, O God, Above the heavens, Let Thy glory be over all the earth. _(Brent Chambers / Ref: Psalm 57:9-11;Psalm 97:9)_"},{"title":"Everything I Am","medlyFrom":0,"medlyTo":0,"href":"/english/81","content":"**Verse 1** Everything I am, (Everything I am) Everything I’ll be, (Everything I’ll be) I give it to You, Lord, (I give it to You Lord) And do it thankfully. (Thankfully) **Chorus** Every song I sing, Every praise I bring, Everything I do, is a gift to You. **Verse 2** Everything I am, (Everything I am) All You’ve given me, (All You’ve given me) I give it to You, Lord, (I give it to You Lord) And do it thankfully. (Thankfully)"},{"title":"We're Together Again","medlyFrom":0,"medlyTo":0,"href":"/english/82","content":"We’re together again, just praising the Lord. We’re together again, in one accord. Something good is going to happen, Something good is in store, We’re together again, just praising the Lord. _(Source unknown)_"},{"title":"When I Think I'm Going Under","medlyFrom":0,"medlyTo":0,"href":"/english/83","content":"**Chorus** When I think I’m going under, Part the waters, Lord. When I feel the waves around me, Calm the sea. When I cry for help, O hear me, Lord, And hold our Your hand. Touch my life, still the raging storm in me. **Verse 1** Knowing You love me Through the burdens I must bear, Hearing Your footsteps, Let me know I’m in Your care, And in the night of my life, You bring the promise of day, Here is my hand, show me the way. **Verse 2** Knowing You love me Helps me face another day, Hearing Your footsteps Drives the clouds and fears away, And in the tears of my life, I see the sorrow bore. Here is my pain, heal it once more."},{"title":"Did You Ever Talk To God Above?","medlyFrom":0,"medlyTo":0,"href":"/english/84","content":"**Verse 1** Did you ever talk to God above? Tell Him that you need a friend to love? Pray in Jesus’ name believing That God answers prayer. Have you told Him all your cares and woes? Every tiny little fear He knows. You can know He’ll always hear and He will answer prayer. **Chorus** You can whisper in a crowd to Him. You can cry when you’re alone to Him You don’t have to pray out loud to Him; He knows your thoughts. On a lofty mountain peak, He’s there. In a meadow by a stream, He’s there. Anywhere on earth you go He’s been there from the start. **Verse 2** Did you ever talk to God above? Tell Him that you need a friend to love? Pray in Jesus’ name believing That God answers prayer. Find the answer in His word, it’s true. You’ll be strong because He walks with you. By His faithfulness He’ll change you, too; God answers prayer. **(Fine)** _(Frances Towle Rath / Ref: Psalm 139:1-2,7; 145:18; Matthew 6:8; Mark 11:24; Philippians 4:6-7)_"},{"title":"Come And See The Beauty Of The Lord","medlyFrom":0,"medlyTo":0,"href":"/english/85","content":"**Verse 1** Come and see the beauty of the Lord. Come and know the wonder of His grace. Come and see how much He cares for you, Gaze at the compassion in His face. **Verse 2** Come and touch the nail prints in His hands. Find the friend who truly understands Come and stand beneath the blood-stained cross, Proof of His unchanging love for us. **Chorus** He is worthy, worthy of our praise! He is worthy, worthy of our praise! He is glorious, He is wonderful. He is everything to me. **Verse 3** Come and see the stone’s been rolled away. The tomb is empty where His body lay. Why seek the living One among the dead? You won’t find Jesus there because He lives! _(Glen Green)_"},{"title":"For You Alone","medlyFrom":0,"medlyTo":0,"href":"/english/86","content":"**Verse** You are the peace that guards my heart, My help in time of need; You are the hope that leads me on, And brings me to my knees. For there I find You waiting, And there I find release; So, with all my heart I’ll worship, And unto You I'll sing. **Chorus** For You alone deserve all glory, For You alone deserve all praise; Father, we worship and adore You. Father, we long to see Your face. For You alone deserve all glory, For You alone deserve all praise; Father, we love You, And we worship You this day. _(Don Harris / Ref: Revelation 19:1)_"},{"title":"When I Look Into Your Holiness","medlyFrom":0,"medlyTo":0,"href":"/english/87","content":"**Verse** When I look into Your holiness, When I gaze into Your loveliness, When all things that surround become shadows in the light of You. When I’ve found the joy of reaching Your heart, When my will becomes enthroned in Your love, When all things that surround become shadows in the light of You. **Chorus** I worship You, I worship You, The reason I live is to worship you. I worship You, I worship You, The reason I live is to worship you. _(Wayne & Cathy Perrin / Ref: Psalm 34:5)_"},{"title":"He's My Best Friend","medlyFrom":0,"medlyTo":0,"href":"/english/88","content":"**Verse 1** He’s the Word of God. (He’s the Word of God) He’s the King of Kings. (He’s the King of Kings) He’s the mighty One. (He’s the mighty One) Who made everything. (Who made everything) **Chorus** He’s the Alpha and Omega, The Beginning and the End. But best of all, You’re my best friend. **Verse 2** He’s the Prince of Peace. (He’s the Prince of Peace) He’s the Bread of Life. (He’s the Bread of Life) He’s the Lamb of God, (He’s the Lamb of God) Who was sacrificed. (Who was sacrificed) **(Chorus)** For all He does, (For all He does) For all His ways, (For all His ways) For all He is, (For all He is) I give Him praise. **Verse 3** He’s the Corner Stone. (He’s the Corner Stone) He’s the Great I Am. (He’s the Great I Am) He’s the Lord of Lords, (He’s the Lord of Lords) Who will come again. (Who will come again) **(Chorus)** For all He does, (For all He does) For all His ways, (For all His ways) For all He is, (For all He is) I give Him praise. **(Repeat Verse 3 and Chorus)** _(Frank Hernandez)_"},{"title":"We Want To Live You Out More","medlyFrom":0,"medlyTo":0,"href":"/english/89","content":"**Verse 1** More of our hearts, dear Lord, we’d give You now, That You may grow therein and gain more room. All is waste, Lord, only You are gain, Our hearts cry out until in us You reign. We leave behind all that distracts, All that draws away our e Cyes. We give heed to Your word Till You blossom in our hearts. All unwillingness You overcome, We enter in Your rest, in You we trust. Lord, our hearts are wholly Yours, Come engrave Your name on us, We want to live You out more. **Verse 2** Lord, don’t allow us to go our own way, Without reluctance, we will choose Your way. We say “amen” when You are speaking, Lord. Yes, work in us, we pray, renew our hearts. Lord, we give to You our hearts For Your house on earth to build. You will live therein And give to us Your own pure being. Lord, touch our sprits more from day to day Forgetting all; we just run after You. We want to know You more each day. Only see You, Christ, our aim, We want to live You out more. _(Translated from the German Hymnbook #234 from the Church in Stuttgart)_"},{"title":"People Need The Lord","medlyFrom":0,"medlyTo":0,"href":"/english/90","content":"**Verse 1** Everyday, they pass me by I can see it in their eyes. Empty people filled with care, Headed who knows where. On they go through private pain, Living fear to fear. Laughter hides the silent cries, Only Jesus hears. **Chorus** People need the Lord, **(2x)** At the end of broken dreams, He’s the open door. People need the Lord, **(2x)** When will we realize? People need the Lord. **Verse 2** We are called to take His light To a world where wrong seems right. What could be too great a cost For sharing life with one who’s lost? Through His love our hearts can feel, All the grief they bear. They must hear the words of life; Only we can share. **Chorus** People need the Lord, **(2x)** At the end of broken dreams, He’s the open door. People need the Lord, **(2x)** When will we realize? That we must give our lives For people need the Lord People need the Lord. **(slower as finale)** _(Phil McHugh and Greg Nelson)_"},{"title":"We Will Glorify","medlyFrom":0,"medlyTo":0,"href":"/english/91","content":"**Verse 1** We will glorify the King of kings. We will glorify the Lamb; We will glorify the Lord of Lords, Who is the great “I AM”. **Verse 2** Lord Jehovah reigns in majesty, We will bow before His throne; We will worship Him in righteousness, We will worship Him alone. **Verse 3** He is Lord of heaven, Lord of earth, He is Lord of all who live; He is Lord above the universe, All praise to Him we give. **Verse 4** Hallelujah to the King of kings, Hallelujah to the Lamb; Hallelujah to the Lord of lords, Who is the great “I AM”. _(Twila Paris / Ref: Revelation 15:3, 4)_"},{"title":"There Is None Like You","medlyFrom":0,"medlyTo":0,"href":"/english/92","content":"**Verse** There is none like You, No one else can touch my heart like You do, I could search for all eternity long And find, there is none like You. **Chorus** Your mercy flows like a river wide, And healing comes from Your hands. Suffering children are safe in Your arms, There is none like You. **(Repeat Verse)** _(Lenny LeBlanc)_"},{"title":"Shepherd Of My Soul","medlyFrom":0,"medlyTo":0,"href":"/english/93","content":"**Verse** Shepherd of my soul, I give You full control, Wherever You may lead I will follow. I have made the choice To listen for Your voice, Wherever You may lead, I will go. **Chorus** Be it in a quiet pasture Or by a gentle stream, The Shepherd of my soul is by my side. Should I face a mighty mountain Or a valley dark and deep The Shepherd of my soul Will be my guide. **(Repeat Verse)** _(Martin Nystrom / Ref: Psalm 23:2)_"},{"title":"In Whom I Can Trust","medlyFrom":0,"medlyTo":0,"href":"/english/94","content":"**Verse** You are the Lord in whom I can trust You are the Rock I can stand upon. Every step of the way, You take my hand and say, You will always be here right beside me, When I call on You, I know You’ll come to me. **Chorus** You are my Lord, in whom I can trust; You are my fortress, You’re my deliverer, My shield, my strength. For all of my days, I place my hope in Jesus, Who loved me with His life The Rock of my salvation in whom I can trust. _(Copyright: Scriptures Union)_"},{"title":"I Was Made To Praise You","medlyFrom":0,"medlyTo":0,"href":"/english/95","content":"**Verse 1** I was made to praise You, I was made to glorify Your name In every circumstance, To find a chance to thank You. I was made to love You, I was made to worship at Your feet. And to obey You, Lord, I was made for You. **Verse 2** I will always praise You, I will always glorify Your name In every circumstance, I'll find a chance to thank You. I will always love You, I will always worship at Your feet And I'll obey You, Lord, I was made for You. _(Chris Christensen / Ref: Psalm 139:14)_"},{"title":"This Is Your Name","medlyFrom":0,"medlyTo":0,"href":"/english/96","content":"This is Your name, forever- The name by which, You are remembered by. No other name, In generations, This is Your name, This is Your name, forever- You are, the God of Abraham, You are, the God of Isaac, You are, the God of Jacob, You are, indeed my God. _(Lim Kai Seong)_"},{"title":"A Moment Like This Is So Hard To Find","medlyFrom":0,"medlyTo":0,"href":"/english/97","content":"**Verse 1** A moment like this is so hard to find; So let me now set my heart, soul and mind, To commune with You in reverent prayer; Here, now, prostrate this portion to bear: **Refrain 1** A heart to be true, A heart to be pure; A life to commit, With love to endure. If this kneeling may lead, My heart be re-phased With full worship, Awe and majestic praise. (Repeat and sing in a different tune) **Verse 2** A moment like this majestic and grand; So let me now rise before Your throne stand, Worshipping You in transcendent praise; Here, now, proclaim (Your) amazing grace: **Refrain 2** A God who forgives, A God from above (Yet) A God who can save, A God who does love. You are the One, I do not deserve; Yet You are there, Always gracious to me... You are the One a God who forgives A God from above (Yet) a God who can save You are the One I do not deserve; Yet You are there always gracious to us. _(Lim Kai Seong)_"},{"title":"I May Be Alone But I Am Not Lonely","medlyFrom":0,"medlyTo":0,"href":"/english/98","content":"I may be alone, but I am not lonely, For I have God with me, That’s what really matters, Though I be far from home, Yet home’s still inside me, For I have God with me, and I am with my God. The Lord is with me, the Lord is with me, Day and night, He’s my guide, He is always near. (He’s here!) The Lord is with me, the Lord is with me, When I wake, in my dreams, He is there with me! _(Lim Kai Seong)_"},{"title":"I Will Wait, I Will Stand","medlyFrom":0,"medlyTo":0,"href":"/english/99","content":"Though my days, be dark and sullen, In my prison, hopelessness looms, Yet I'll wait in anticipation, For my God, He will save. Though my deeds, may be forgotten, And my dreams, seem so far away, But I'll learn, I'll learn to wait and pray, For my God, He will save. I will wait, I will stand, Not bow down, to fate of man, For I know, He has a greater plan – It's written in the stars, and revealed in my dreams – So I'll wait, I will stand, Till He comes, reach for my hand, Pull me up, to a higher place, That I may rest, in His embrace. _(Lim Kai Seong)_"},{"title":"By His Hands","medlyFrom":0,"medlyTo":0,"href":"/english/100","content":"The arms of my hands, They were all made strong, Not by man's endeavour. They should have been weak, With the many shots, of the archers. But my hands held fast, I could not fail, I know my God will keep me in strength, My very arms were strengthened by His hands. By His hands, by His hands, The hands of the mighty God of Jacob, By His hands, By His hands, The hands of the God of Jacob. _(Lim Kai Seong)_"},{"title":"Lord, Now I See","medlyFrom":0,"medlyTo":0,"href":"/english/101","content":"**Verse 1** Lord, now I see – You only want me to believe. Not to dwell In all my failures and defeats, To believe what You have done, Not in what I see. **Verse 2** Lord, I believe When all around me is defeat, And it seems That nothing’s changing outwardly, No, I’m not discouraged I’m believing You. **Verse 3** Yes, I believe, And there is no demand on me. Simple faith; Yes, that is all You want from me. Free from anxious doubting, I’m free to just believe. **Verse 4** Believing You Because Lord, You are my success. When I fail, All I must do is just confess And go on enjoying You. I love believing You. _(From Youth Hymnbook #216 from the Church in Fountain Valley)_"},{"title":"Dearest Lord, You've Called Us Here","medlyFrom":0,"medlyTo":0,"href":"/english/102","content":"**Verse 1** Dearest Lord, You’ve called us here, And opened up Your heart. Oh the joy to hear Your call And enter in the Ark. Saving us from day to day, O Lord, this is Your way. In Yourself we stay afloat Above the wicked age today. **Chorus** Thank You, Lord, in Your eyes, we find grace. And with opened hearts we come to You. Regardless what our friends might say to us or do, O Lord Jesus, we love You. **Verse 2** Seeking of this age to taste, And of it have a part. If we only knew, dear Lord, The ways we grieve Your heart. We would come and turn to You With a repenting heart, And would give ourselves to be With You, O Lord, inside the Ark. **Verse 3** Praise the Lord, we’re safe in You, Outside death-waters pour. Many things that I once loved Are on the ocean floor. Keep us open to You Lord, Don’t let us miss the mark. Hallelujah, Praise the Lord! We’re here within the church, the Ark. _(Youth Hymnbook #256 from the Church in Fountain Valley)_"},{"title":"More Of Our Hearts","medlyFrom":0,"medlyTo":0,"href":"/english/103","content":"**Verse 1** More of our hearts, dear Lord, We’d give You now; Even more ground to You, Lord, we’d allow. All that distracts us we’d despise, All that draws away our eyes – Lord, do fill our vision ’Till the morning star has risen! We would count all things loss, but Jesus gain, Our inward parts cry out for You to reign. Worthy You are our hearts to claim – Come, engrave on us Your name, We would love you, Jesus, more. **Verse 2** Less we would argue, Lord, And go our way. More we would say “Amen” to what You say. Grant us a walk to You conformed, ’Till our living is transformed We adore You, Jesus – May a pure love for You seize us. Any unwillingness, Lord, quickly slay, Even by faith we open, all the way – Rising to heights of love unknown, Christ our destiny alone, We would love you, Jesus, more. _(From Youth Hymnbook #259 from the Church in Fountain Valley)_"},{"title":"Come Ye Beloved Of The Lord","medlyFrom":0,"medlyTo":0,"href":"/english/104","content":"**Verse 1** Come ye beloved of the Lord And consider all the love That the Father has poured out on you. With joyful hearts in one accord Come and look upon the love Of the One who gave His all for you. **Chorus** Our God withheld not His own Son, The treasure of His heart, Poured out for you. Since He already gave His Son, What now will He withhold From you, His own? **Verse 2** My friend, consider then the price That so willingly He paid To redeem and win you back to Him. Consider how then you will live And just how to spend the days And the freedom He has won for you. **Verse 3** With all the treasures of His throne Of the earth, and of the sky And of the universe beyond, Our Father gave instead His Son Counting His worth far beyond All the treasures of His Kingdom home. _(From Youth Hymnbook #512 from the Church in Fountain Valley)_"},{"title":"My God Is Real","medlyFrom":0,"medlyTo":0,"href":"/english/105","content":"**Verse 1** There are some things, I may not know. There are some places I can’t go. But I am sure of this one thing, That God is real for I can feel Him deep within. **Chorus** My God is real, real in my soul. My God is real for He has washed and made me whole; His love for me is like pure gold, My God is real for I can feel Him in my soul. **Verse 2** Some folks may doubt, some folks may scorn; All can desert and leave me alone. But as for me, I’ll take God’s part, For God is real and I can feel Him in my heart. **Verse 3** I cannot tell; just how you felt, When Jesus took your sins away. But since that day, yes since that hour, God has been real for I can feel His Holy Power."},{"title":"I Am A New Creation","medlyFrom":0,"medlyTo":0,"href":"/english/106","content":"**Verse** By Your love You’ve shown the way; By Your grace I have been saved, Jesus, You have blessed me everyday. In my life I have been weary, You remind me of Your glory; You have changed my life in every way. **Chorus** I am a new creation, When I place my life into Your hands ‘Cause Jesus with Your love You’ve made me whole. I lift my hands in worship; I live my life to bring You joy, I know that in Your love I will be whole. _(Steven Wee)_"},{"title":"Fight Of Faith","medlyFrom":0,"medlyTo":0,"href":"/english/107","content":"**Verse** Here I am at Your feet crying out to You Draw me near, hold me close Lord I wait on You. For You’re my greatest Love You’re my comforter and strength You’re the First, You’re the Last You’re my guiding Light **Chorus** I will run, I will soar On eagle’s wings. As I wait on You, Lord, My strength is restored. Fix my eyes on You Jesus, As I run this race. Help me fight this fight of faith. _(Jocelyn Ong)_"},{"title":"When It's All Been Said And Done","medlyFrom":0,"medlyTo":0,"href":"/english/108","content":"**Verse** When it’s all been said and done There is just one thing that matters Did I do my best to live for truth? Did I live my life for You? When it’s all been said and done All my treasures will mean nothing Only what I’ve done for love’s reward Will stand the test of time. **Chorus** Lord, Your mercy is so great That You look beyond our weakness And find purest gold in miry clay Turning sinners into saints I will always sing Your praise Here on earth and ever after For You’ve shown me Heaven’s my true home When it’s all been said and done You’re my life when life is done. Lord I’ll live my life for You. _(James A. Cowan / “When It’s All Been Said and Done”)_"},{"title":"I Stand In Awe Of You","medlyFrom":0,"medlyTo":0,"href":"/english/109","content":"**Verse** You are beautiful beyond description Too marvelous for words; Too wonderful for comprehension, Like nothing ever seen or heard. Who can grasp Your infinite wisdom? Who can fathom the depths of Your love? You are beautiful beyond description, Majesty, enthroned above. **Refrain** And I stand, I stand in awe of You, I stand, I stand in awe of You; Holy God, to Whom all praise is due, I stand in awe of You. _(Mark Altrogge)_"},{"title":"Who Can Fathom?","medlyFrom":0,"medlyTo":0,"href":"/english/110","content":"**Verse 1** Who can stand, who can stand? Before the anger of the LordWho can shout, who can say? “I have no need of God”? Who can fathom the power of His might? The greatness of His strike, the force of His right hand? Who can fathom the potter’s way with His clay? Who can stand against You Lord? **Verse 2** Do we know or understand? The depth of the Love of God? Do we dare, can we say? “I have no need of His Love”? Who can fathom the splendor of His Love? The visits of His grace, the saving by His hand? Who can fathom the thoughts of His mind? They are too wonderful for me! **Refrain** May I start afresh Before You my Lord May I now confess I am nothing before You my God: Your word has promised; If I will return - Then You will return And restore me again. Who can fathom the splendor of His Love? The visits of His grace, the saving by His hand? Who can fathom the thoughts of His mind? They are too wonderful for me! _(Lim Kai Seong)_"},{"title":"Lord, I Do Love You More And More Each Day","medlyFrom":0,"medlyTo":0,"href":"/english/111","content":"**Verse 1** Lord, I love You more and more each day. Lord, I love You more this very day. I can’t live without You anymore. I can’t make it like I did before. **Verse 2** Oh, those years when I was void of You. Lord, You rescued me when I was through. When I reminisce those other years, Emptiness, heartaches, and many tears. **Chorus** Lord, I do love You more everyday. Lord, I do love You much more this very day. **verse 3** Oh, that thirst that gnawed me deep within: Drove me looking for sa-tisfaction. Oh, the many things that I have tried: Left me thirsting and dissa-tisfied. **Verse 4** In this endless search for something new, All the time this cry was just for You. I was blind in trying many things ‘Till I drank You as my liv-ing Spring. **(Chorus)** **Verse 5** Lord, You came and filled my inmost being. You’re the sweetest satisfac-tion. You’re the Spirit as my everything, Spirit in my spirit bubbling. **Verse 6** Thank You, Lord, for coming into me. Now You’re spreading in me constantly. Lord, You’re making home in all my heart, As my treasure filling e-very part. **(Chorus)** _(Howard Hagashi)_"},{"title":"Still","medlyFrom":0,"medlyTo":0,"href":"/english/112","content":"**Verse 1** Hide me now, Under Your wings. Cover me within Your mighty Hands. **Chorus** When the oceans rise and thunders roar, I will soar with You above the storm. Father, You are King over the floods. I will be still and know You are God. **Verse 2** Find rest my soul, In Christ alone. Know His pow'r In quietness and trust. _(Reuben Morgan)_"},{"title":"Above All","medlyFrom":0,"medlyTo":0,"href":"/english/113","content":"**Verse 1** Above all powers, above all kings, Above all nature, and all created things; Above all wisdom and all the ways of man, You were here before the world began. **Verse 2** Above all kingdoms, above all thrones, Above all wonders the world has ever known; Above all wealth and treasures of the earth, There's no way to measure what You're worth. **Chorus** Crucified, and laid behind a stone You lived to die, rejected and alone. Like a rose trampled on the ground, You took the fall, and thought of me - Above all. **(Repeat Verses 1 & 2)** Crucified, laid behind a stone. You lived to die, rejected and alone. Like a rose trampled on the ground, You took the fall, and thought of me - Above all. Like a rose trampled on the ground, You took the fall, and thought of me - Above all. _(Lenny Leblanc and Paul Baloche)_"},{"title":"All Heaven Declares","medlyFrom":0,"medlyTo":0,"href":"/english/114","content":"**Verse 1** All heaven declares The glory of the risen Lord Who can compare With the beauty of the Lord? Forever He will be The Lamb upon the throne I gladly bow the knee And worship Him alone. **Verse 2** I will proclaim The glory of the risen Lord Who once was slain To reconcile man to God Forever You will be The Lamb upon the throne I gladly bow the knee And worship You alone. _(Noel and Tricia Richards / Ref: Psalm 19:1; Revelation 5:12)_"},{"title":"Ancient Words","medlyFrom":0,"medlyTo":0,"href":"/english/115","content":"**Verse 1** Ancient words, long preserved For our walk in this world They resound with God’s own heart Oh let the ancient words impart. Words of life, words of hope Give us strength, help us cope In this world, where’er we roam Ancient words will guide us home. **Chorus** Ancient words, ever true Changing me and changing you We have come with open hearts Oh let the ancient words impart. **Verse 2** Holy words of our faith Handed down to this day Came to us through sacrifice Oh heed the faithful words of Christ. Holy words, long preserved For our walk in this world They resound with God’s own heart Oh let the ancient words impart. **(Repeat Chorus twice)**"},{"title":"Approved In Every Way","medlyFrom":0,"medlyTo":0,"href":"/english/116","content":"**Verse 1** I want to be Your servant, Lord, To serve You each and every day. I want to give my best to You Approved in every way. **Chorus** Make my life a living sacrifice The way You want me to be To serve You with all my heart Whatever the cost to me. Take me, break me, mould me, Lord As the Potter shapes the clay Pleasing You in all I do Approved in every way. **Verse 2** I’ll stand before Your righteous throne To hear “Thou good and faithful one” “Well done” from the Master’s lips Approved in every way. _(Copyright: Ng Wah Lok and Voon Yuen Woh)_"},{"title":"How Great Is Our God","medlyFrom":0,"medlyTo":0,"href":"/english/117","content":"**Verse 1** The splendor of a King, clothed in majesty Let all the earth rejoice, all the earth rejoice He wraps himself in Light, and darkness tries to hide And trembles at His voice, trembles at His voice **Chorus** How great is our God, sing with me How great is our God, and all will see How great, how great is our God **Verse 2** Age to age He stands, and time is in His hands Beginning and the end, Beginning and the end The Godhead Three in One, Father, Spirit, Son The Lion and the Lamb, The Lion and the Lamb **(Chorus)** **Bridge** Name above all names Worthy of our praise My heart will sing How great is our God **(Chorus) x 2** _(Chris Tomlin)_"},{"title":"Here I Am To Worship","medlyFrom":0,"medlyTo":0,"href":"/english/118","content":"**Verse 1** Light of the world You stepped down into darkness Open my eyes let me see Beauty that made this heart adore You Hope of a life spent with You **Chorus** Here I am to worship Here I am to bow down Here I am to say that You're my God You're altogether lovely Altogether worthy Altogether wonderful to me **Verse 2** King of all days Oh so highly exalted Glorious in heaven above Humbly You came to the earth You created All for loves sake became poor **(Chorus)** **Bridge (x2)** I'll never know how much it cost To see my sin upon that cross **Chorus** Here I am to worship Here I am to bow down Here I am to say that You're my God You're altogether lovely Altogether worthy Altogether wonderful to me _(Tim Hughes)_"},{"title":"In Christ Alone","medlyFrom":0,"medlyTo":0,"href":"/english/119","content":"**Verse 1** In Christ alone my hope is found, He is my light, my strength, my song; This Cornerstone, this solid Ground, Firm through the fiercest drought and storm. What heights of love, what depths of peace, when fears are stilled, when strivings cease! My Comforter, my All in All, Here in the love of Christ I stand. **Verse 2** In Christ Alone! Who took on flesh, Fullness of God in helpless babe. This gift of love and righteousness, Scorned by the ones He came to save: Till on that cross as Jesus died, The wrath of God was satisfied - For every sin on Him was laid; Here in the death of Christ I live. **Verse 3** There in the ground His body lay, Light of the world by darkness slain: Then bursting forth in glorious day Up from the grave He rose again! And as He stands in victory Sin's curse has lost its grip on me, For I am his His and He is mine - Bought with the precious blood of Christ. **Verse 4** No guilt in life, no fear in death, This is the power of Christ in me; From life's first cry to final breath, Jesus commands my destiny. No power of hell, no scheme of man, Can ever pluck me from His hand: Till He returns or calls me home, Here in the power of Christ I'll stand. _(Keith Getty, Stuart Townend)_"},{"title":"I Love You!","medlyFrom":0,"medlyTo":0,"href":"/english/120","content":"**Verse 1** Let me stand behind You, Lord. Let me wash Your feet with my tears. Let me wipe them with my hair. Let me kiss them and anoint them with the ointment. I love You! Jesus, I love You! May I waste my all and life on You. Let me pour the ointment pure On Your head and on Your feet, On You, Most Precious One Because I love You. **Verse 2** Let me take a pound of ointment pure Of great value to anoint Your feet And wipe them with my hair That the house be filled with the fragrance of the ointment. (Repeat Chorus 1) **Verse 3** Lord, they say if You were a prophet, You should know who and what I am. I'm a sinner that toucheth You, A woman not worthy to anoint You. But I love You! Jesus, I love You! You forgave me the most Now I love You, Lord, the most. Let me pour the ointment pure On Your head and on Your feet, On You, most precious one, Because You love me. **Verse 4** Let my love from my being wash your feet To my glory without wipe them too. Let me kiss them where the nails would pierce. All my love, Lord, and glory I'll waste on You. I love You! Jesus, I love you! All my glory and love I pour and waste on You. Receive my ointment, Lord. It's all I have, dear Lord, For You, most precious one, Because I love You. _(Luke 7:36-50)_"},{"title":"Come Bless The Lord","medlyFrom":0,"medlyTo":0,"href":"/english/121","content":"Come bless the Lord, all ye servants of the Lord, Who stand by night, in the house of the Lord. Lift up your hands in the holy place And bless the Lord, and bless the Lord. _(Composer unknown / Ref: Psalm 134:1,2)_"},{"title":"Pass Me Not, O Gentle Saviour","medlyFrom":0,"medlyTo":0,"href":"/english/122","content":"**Verse 1** Pass me not, O gentle Saviour - Hear my humble cry! While on others Thou art calling, Do not pass me by. **Refrain** Saviour, Saviour, Hear my humble cry! While on others Thou art calling, Do not pass me by. **Verse 2** Let me at Thy throne of mercy Find a sweet relief; Kneeling there in deep contrition - Help my unbelief. **Verse 3** Trusting only in Thy merit, Would I seek Thy face; Heal my wounded, broken spirit, Save me by Thy grace. **Verse 4** Thou the spring of all my comfort, More than life to me! Whom have I on earth beside Thee? Whom in heav’n but Thee? _(Text: Fanny J. Crosby; Music: William H. Doane / Ref: 2 Peter 3:9)_"},{"title":"I Want To Be Where You Are","medlyFrom":0,"medlyTo":0,"href":"/english/123","content":"**Verse 1** I just want to be where You are Dwelling daily in Your presence I don't want to worship from afar Draw me near to where You are **Verse 2** I just want to be where You are In Your dwelling place forever Take me to the place where You are I just want to be with You **Chorus** I want to be where You are, dwelling in Your presence Feasting at Your table, surrounded by Your glory In Your presence, that's where I always want to be I just want to be, I just want to be with You **Bridge** Oh my God, You are my strength and my song And when I'm in Your presence Though I'm weak You're always strong"},{"title":"Restore, O Lord","medlyFrom":0,"medlyTo":0,"href":"/english/124","content":"**Verse 1** Restore, O Lord, the honor of Your name, In works of sov’reign power Come shake the earth again, That men may see And come with rev’rent fear To the living God whose kingdom shall outlast the years. **Verse 2** Restore, O Lord, in all the earth Your fame, And in our time revive The church that bears Your name. And in Your anger, Lord, remember mercy, O living God whose mercy shall outlast the years. **Verse 3** Bend us, O Lord, where we are hard and cold, In Your refiner’s fire Come purify the gold. Through suffering comes And evil crouches near, Still our living God Is reigning, He is reigning here. **(Repeat and end with Stanza 1)** _(Graham Kendrick & Chris Rolinson)_"}],"chinese":[]}