{"english":[{"title":"Jesus Shall Take The Highest Honour","medlyFrom":0,"medlyTo":0,"href":"/english/1","content":"**Verse 1** Jesus shall take the highest honour Jesus shall take the highest praise Let all the earth join heav’n in exalting The name which is above all other names. **Verse 2** Let’s bow the knee in humble adoration For at His name every knee must bow Let every tongue confess He is Christ, God’s only Son Sovereign Lord, we give you glory now. **Chorus** For all honour and blessing and power Belongs to you, belongs to you. All honour and blessing and power. Belongs to you, belongs to you, Lord Jesus Christ, Son of the Living God. _(Chris Bowater)_"},{"title":"Jesus We Enthrone You","medlyFrom":0,"medlyTo":0,"href":"/english/2","content":"Jesus, we enthrone You, We proclaim you are King. Standing here in the midst of us; We raise You up with our praise. And as we worship, build Your throne. And as we worship, build Your throne. And as we worship, build Your throne. Come, Lord Jesus and take Your place. _(Don Moen)_"},{"title":"Who Shall Not Fear Your Name","medlyFrom":0,"medlyTo":0,"href":"/english/3","content":"**Verse 1** Who shall not fear Your name, O King? O Lord of all the earth? For this is Your rightful due. In all the kingdoms of the world, The name of Jesus stands alone For there is none like You! **Verse 2** Who shall not honour You, O King? O Lord of all the earth? For this is Your rightful due. In all the kingdoms of the world, The name of Jesus stands alone For there is none like You! **Verse 3** Who shall not worship You, O King? O Lord of all the earth? For this is Your rightful due. In all the kingdoms of the world, The name of Jesus stands alone For there is none like You! **Chorus** Who shall not fear Your Name? Who shall not honour You? Who shall not worship Christ - the King of Glory? Who shall not fear Your Name? Who shall not honour You? Who shall not worship Christ the Lord of all? **(Repeat Verse 1)** The name of Jesus stands alone For there is none like You! _(Oasis Worship)_"},{"title":"My Tribute (To God Be The Glory)","medlyFrom":0,"medlyTo":0,"href":"/english/4","content":"**Verse 1** How can I say thanks For the things You have done for me - Things so undeserved, Yet You give to prove Your love for me? The voices of a million angels Could not express my gratitude - All that I am and ever hope to be, I owe it all to Thee. **Refrain** To God be the glory, To God be the glory; To God be the glory For the things He has done. With His blood He has saved me; With His pow’r He has raised me; To God be the glory For the things He has done. **Verse 2** Just let me live my life; Let it be pleasing, Lord, to Thee. And should I gain any praise, Let it go to Calvary. **Refrain** With His blood He has saved me; With His pow’r He has raised me; To God be the glory For the things He has done _(Andraé Crouch / Ref: Psalm 115:1)_"},{"title":"I'm Gonna Praise God Unceasingly","medlyFrom":0,"medlyTo":0,"href":"/english/5","content":"**Verse 1** I'm gonna praise God unceasingly Because He lives in me, He's everything to me, Gives life continually. I'm gonna praise God unceasingly Because He lives in me, And He will never leave. **Chorus** Now in our spirit we can feed, Jesus Christ is all we need, Call His name and He becomes reality. Open up your mouth and you will see, Just how rich our Lord can be. He's the very life-supply, complete is He. **Verse 2** Now I live by the tree of life, His fruit does nourish me, O how it strengthens me, I'll live eternally. Now I live by the tree of life, Him daily I apply, He is my food supply. **Verse 3** There's a river of life in me, Flowing so livingly, Moving continually, He just keeps flooding me. There's a river of life in me, He's always filling me, His name is Jesus Christ!"},{"title":"Jesus, You're Alive!","medlyFrom":0,"medlyTo":0,"href":"/english/6","content":"**Verse 1** From the time I spoke Your name Lord, my life's not been the same Since I called on the only one who'd saved me. When forsaken, in despair - Who'd have thought that You'd be there! Now I've found out, Jesus, You're alive! All my friends might think it's square - Since I touch You I don't care - For I've found You're the only life worth living. Though some mock and criticize, Lord, they just don't realize, That I've found out, Jesus, You're alive! **Chorus** Now my eyes begin to see I'm living as I ought to be, As this turning, burning God moves in my heart I don't care now how I feel. I just know that this is real, And I know, Oh Jesus, You're alive! It's no statue that I call, Not a picture on the wall But a person who lives His life within me. Wish they'd told me long before All You want's an open door And that really, Jesus, You're alive! **(Repeat Chorus)** I don't care now how I feel. I just know that this is real, And I know, oh Jesus, You're alive!"},{"title":"Like Honey In The Rock","medlyFrom":0,"medlyTo":0,"href":"/english/7","content":"**Verse** He is my everything, He is my All. He is my everything, both great and small. He gave His Life for me, made everything new. He is my everything, now how about you? **Chorus** Like honey in the rock, Sweet honey in the rock, For He tastes like honey in the rock. Oh taste and see that the Lord is good, For He tastes like honey in the rock."},{"title":"I Just Keep Calling O Lord","medlyFrom":0,"medlyTo":0,"href":"/english/8","content":"**Verse** I just keep calling O Lord, as I walk along. I just keep calling O Lord, and He gives a song. Tho’ the storm clouds darken the sky o’er the heav’nly trail, I just keep calling O Lord, He will never fail! **Chorus** He’s a faithful Friend, such a faithful Friend. I can count on Him to the very end! Tho’ the storm-clouds darken the sky o’er the heav’nly trail, I just keep calling, O Lord, He will never fail!"},{"title":"From The Rising Of The Sun","medlyFrom":0,"medlyTo":0,"href":"/english/9","content":"**Verse** From the rising of the sun, to the going down of the same, the Lord's name is to be praised! **(Repeat Verse)** **Chorus** Praise ye the Lord! Praise ye all ye servants of the Lord! Praise the name of the Lord! Blessed be the name of the Lord, From this time forth, and forevermore!"},{"title":"O Lord, We're Just For Your Flowing!","medlyFrom":0,"medlyTo":0,"href":"/english/10","content":"**Verse 1** There's a life that's deeper than our mind With experience of man, yet so divine. It's a life that knows no bounds; And with glory is crowned; It's of depth and height and breadth unsearchable. Now this life is just the living one Manifested in the Person of the Son. As the Spirit, He flows; In our spirit He grows, Growing up to be the Church that He desires. **Chorus** O Lord, we're just for Your flowing; How we need a deeper knowing! Life is why we're here And why You've come in us. Turn us, Lord, turn us now; Turn us deeply - life is how You will get the Church, The home You're longing for. **Verse 2** In the Church, we all can apprehend All the riches of this life that is within. Not just shallowness with strife, But a deep and peaceful life, Is just waiting to flow out, a living spring. With the saints it's easy to be bold, To pursue this life, to gain it, to lay hold. All the other things we find, Must be quickly left behind, So that only life remains for us to see. **Verse 3** Deeper, Lord, our turn must be to You; We would move by life in everything we do: All our concept refute, For Your life be absolute - Grant us grace to turn much deeper day by day. When we touch our spirit - such a thrill! This is far beyond emotion, mind and will It's within our hidden part. Come, make home in all our heart; Let Your presence flow as rivers deep within."},{"title":"Christ The Real Life Giver","medlyFrom":0,"medlyTo":0,"href":"/english/11","content":"Christ the real life giver, Gives life to me, And every time I call on Him, His Spirit sets me free; Christ the real life giver, Lives now in me: No longer is He just a name, But my reality!"},{"title":"For Thou Oh Lord Art High Above","medlyFrom":0,"medlyTo":0,"href":"/english/12","content":"**Verse** For Thou, Lord, art high above all the earth. Thou art exalted far above all gods. For Thou, Lord, art high above all the earth. Thou art exalted far above all gods. **Chorus** I exalt Thee. I exalt Thee. I exalt Thee, O Lord. I exalt Thee. I exalt Thee. I exalt Thee, O Lord. _(Pete Sanchez Jr)_"},{"title":"Lord, Keep My Heart Always True To You","medlyFrom":0,"medlyTo":0,"href":"/english/13","content":"**Verse 1** Lord, keep my heart always true to You; Never backsliding, always viewing You; A heart that is pure, and sees only You; A heart that loves You, and treasures only You. **Chorus** Your love constrains me to give my all to You. Lord I can't help it, my heart is drawn to You; Oh what a privilege; I give myself to You! I love You, Lord, dearest Lord, I love You, I just love You. **Verse 2** Lord, keep my love burning brightly for You; A love never dwindling, always hot for You; A love shining brighter all the way for You; A love so fresh like the day I first touched You. **Verse 3** Lord, take my life, I present it to You; If I had a thousand I'd pour all on You; Nothing withholding, my all is for You; My life, and my future, dear Lord, is all for You. _(Howard Higashi)_"},{"title":"Calling, O Lord Jesus","medlyFrom":0,"medlyTo":0,"href":"/english/14","content":"Calling, \"O Lord Jesus!\" Oh, it makes our spirit strong! We can really touch Him, And our gloom is turn to song! Don't listen to Satan, with all his distraction; Just turn to your spirit, and spring into action! Calling, \"O Lord Jesus!\" You'll enjoy Him all day long!"},{"title":"God's Word Is A Lamp Unto My Feet","medlyFrom":0,"medlyTo":0,"href":"/english/15","content":"**Verse 1** God's word is a lamp unto my feet God's word is a light unto my path. God's word is a lamp unto my feet; God's word is a light unto my path. **Verse 2** God's word have I hidden in my heart. That I might not sin against my God. God's word have I hidden in my heart. That I might not sin against my God. **Verse 3** God's word is a shining, searching word; It shows me the secrets of my heart. God's word is a shining, searching word; It shows me the secrets of my heart. **Verse 4** God's word is eternal, strong and sure; God speaks and His word will come to pass. God's word is eternal, strong and sure; God speaks and His word will come to pass. **Verse 5** Faith comes from the hearing of God's word; His word is implanted in my heart. Faith comes from the hearing of God's word; His word is implanted in my heart. **Verse 6** God's word is the breathing out of God, To breath God's own nature into man. God's word is the breathing out of God, To breath God's own nature into man. **Verse 7** How sweet are God's word unto my taste, Yes, sweeter than honey to my mouth. How sweet are God's word unto my taste, Yes, sweeter than honey to my mouth. **Verse 8** God's word is the true and living word- The joy and rejoicing of my heart! God's word is the true and living word- The joy and rejoicing of my heart!"},{"title":"Jesus Take Me As I Am","medlyFrom":0,"medlyTo":0,"href":"/english/16","content":"Jesus take me as I am. I can come no other way. Take me deeper into You. Make my flesh life melt away. Make me like a precious stone, Crystal clear and finely honed, Life of Jesus shining through, Giving glory back to you. _(Dave Bryant)_"},{"title":"Blessed Be The Lord God","medlyFrom":0,"medlyTo":0,"href":"/english/17","content":"**Verse** Blessed be the Lord God, the God of Israel, Blessed be the Lord God, the God of Israel, Who only doeth wondrous things. Who only doeth wondrous things. And blessed be His glorious name forever. **Chorus** And let the whole earth be filled with His glory, Amen! Amen, Amen, and Amen. **(Repeat Verse)** _(Ref: Psalm 72:18-19 KJV)_"},{"title":"When'er I Call Lord Jesus","medlyFrom":0,"medlyTo":0,"href":"/english/18","content":"**Verse 1** When'er I call Lord Jesus Sure it sets my heart aglow; Just to feel His life arising That Christ in me may grow. Just call with us, \"Lord Jesus\" It's the greatest joy on earth! And then Christ will come into you, And you'll have another birth. **Verse 2** Just call with us, \"Lord Jesus\" He will surely set you free, If your heart is far, far from Him Whenever you may be. We simply call upon Him, No matter where we are. And calling thus, He enters, Oh, He's never very far. **Verse 3** Just call upon our Saviour, Sure He'll hear you every time. Lean your weary head upon Him And rest in sweet recline. For He is our strong fortress, Our peace, our joy, our rest. When we taste the grace of Jesus, Sure we're tasting the very best. **Verse 4** The best is just Himself now, And Himself He freely gave. So let's open up to Him now, And by His life be saved. And when He comes to meet us, As His bride we'll ready be. If today He grows within us, We shall then His glory see."},{"title":"Garment Of Praise","medlyFrom":0,"medlyTo":0,"href":"/english/19","content":"**Chorus** Put on the garment of praise For the spirit of heaviness. Lift up your voice to God. Praise with the spirit and with understanding. Oh, magnify the Lord. **Verse 1** All you that mourn in Zion, I have authority To appoint unto you in Zion Oil of joy that will set you free. **Verse 2** Lift up the hands that hang down. Lift up the voice now still. Give unto God continuous praise. Sing forth from Zion’s hill. **Verse 3** Sing to Yahweh, hallelujah. Worship and praise our God. Praise and adore Him. Bow down before Him. Oh, magnify the Lord. _(David Ingals)_"},{"title":"It's No Longer I That Liveth","medlyFrom":0,"medlyTo":0,"href":"/english/20","content":"It's no longer I that liveth But Christ that liveth in me It's no longer I that liveth But Christ that liveth in me He lives! He lives! Jesus is alive in me, It's no longer I that liveth, But Christ that liveth in me. _(Sally Ellis / Ref: Galatians 2:20)_"},{"title":"Lord, I Lift Your Name On High","medlyFrom":0,"medlyTo":0,"href":"/english/21","content":"**Verse** Lord, I lift Your name on high, Lord, I love to sing Your praises. I’m so glad You’re in my life, I’m so glad You came to save us. **Chorus** You came from heaven to earth To show the way, From the earth to the cross My debt to pay From the cross to the grave, From the grave to the sky; Lord, I lift Your name on high."},{"title":"Change My Heart, O God","medlyFrom":0,"medlyTo":0,"href":"/english/22","content":"**Verse** Change my heart, O God, Make it ever true; Change my heart, O God, May I be like You. **Chorus** You are the Potter, I am the clay; Mould me and make me, This is what I pray. **(Repeat Verse)** _(Eddie Espinosa / Ref: Psalm 51:10)_"},{"title":"In Eternity Past","medlyFrom":0,"medlyTo":0,"href":"/english/23","content":"**Verse 1** In eternity past, For His glorious purpose, God the Father elected us in His love. Thus the Gospel did come, At the time He appoints, To turn us to the Lord, From all idols we had. **Chorus 1** From darkness into light, From idols unto God, A true and living God, We are called to serve! **Verse 2** We are called to be saints, Through His life He imparts, Separating us from everything unto God. 'Tis His purpose to sanctify us to Himself, From our spirit to our entire being. **Chorus 2** To live a holy life Unto our Lord. Partaking of His life, Christ to express!"},{"title":"He Has Made Me Glad","medlyFrom":0,"medlyTo":0,"href":"/english/24","content":"**Verse** I will enter His gates with thanksgiving in my heart, I will enter His courts with praise. I will say this is the day that the Lord has made, I will rejoice for He has made me glad. **Chorus** He has made me glad, He has made me glad, I will rejoice for He has made me glad. _(Composer unknown / Ref: Psalms 100:4, 118:24)_"},{"title":"For His Anger Is But For A Moment","medlyFrom":0,"medlyTo":0,"href":"/english/25","content":"**Verse 1** I will extol Thee, O LORD, for Thou hast lifted me up, And hast not let my enemies rejoice over me. O LORD my God, I cried to Thee, I cried to Thee for help and Thou didst heal me. **Chorus** For His anger is but for a moment, His favor is for a lifetime; Weeping may last for the night, But a shout of joy comes in the morning. **Verse 2** O LORD, Thou hast brought up my soul from Sheol; Thou hast kept me alive, that I should not go down to the pit. Sing praise to the LORD you His godly ones, And give thanks, give thanks to His holy name. **(Repeat Chorus)** **Verse 3** Thou hast turned my mourning into dancing for me. Thou hast put off my sackcloth; Thou hast turned my mourning into dancing for me, And girded me with gladness; To the end my glory may sing praise unto Thee, And not be silent. O LORD my God, I will give thanks unto Thee forever. _(Ref: Psalm 30)_"},{"title":"A Chasing Of The Wind","medlyFrom":0,"medlyTo":0,"href":"/english/26","content":"**Verse 1** Every heart is filled with longing… To be free from all life’s pain. Yet the search through earthly pleasures Always ends in vain. Only God who made the heavens Can satisfy our souls… **Chorus** Apart from Him and all His meaning All things fail, as they begin. And hearts deceived, can only know A chasing of the wind. **Verse 2** All achievements, all possessions; All with time return to dust Only God can be our reason For deep and quiet trust He will guard us from the dangers That gladly make men fools... _(Ref: Ecclesiastics)_"},{"title":"Therefore Being Justified By Faith","medlyFrom":0,"medlyTo":0,"href":"/english/27","content":"**Verse 1** Therefore being justified by faith, We have peace with God, Through our Lord Jesus Christ - **Chorus** Because the love of God is shed abroad in our hearts by the Holy Spirit, Which is given, which is given, Unto us, to us, to us. **Verse 2** God had commended His love towards us, In that while we were sinners, Christ died for us - _(Ref: Romans 5:1)_"},{"title":"Because He Lives","medlyFrom":0,"medlyTo":0,"href":"/english/28","content":"**Verse 1** God sent His Son, they called Him Jesus, He came to love, heal and forgive; He lived and died, to buy my pardon, An empty grave is there to prove My Savior lives. **Chorus** Because He lives, I can face tomorrow, Because He lives, all fear is gone Because I know (I know) He holds the future And life is worth the living just because He lives. **Verse 2** The Son of God, He paid my ransom; Went to the cross, my sins to bear. No greater love! His life He laid down; He died for me and thus forever set me free. **Verse 3** Now I serve Him, my living Saviour; I walk with Him from day to day. He leads me on the heav’nly pathway; I know He keeps me in the shadow of His wings. _(Stanza 1 & Chorus by Gloria Gaither & William J. Gaithe / Ref: John 14:19) (Stanza 2 & 3 by S.H. Tow)_"},{"title":"Remember Him","medlyFrom":0,"medlyTo":0,"href":"/english/29","content":"**Verse** Remember, remember, Remember Him, Thy creator. Remember, remember Remember Him in Thy youth. **Chorus** While you are strong, And breath is in you. While you are at the brink of the fountain of youth... _(K.S. Lim / Ref: Ecclesiastes 12:1)_"},{"title":"I'm Singing For My Lord","medlyFrom":0,"medlyTo":0,"href":"/english/30","content":"**Verse 1** I’m singing for my Lord Everywhere I go, Singing of His wondrous love That the world may know How He saved a wretch like me By His death on Calvary - I’m singing for my Lord Everywhere I go. **Verse 2** I’m singing, but sometimes Heavy is the load For this world is not a friend To the grace of God; Yet I’ll sing the whole day long, For He fills my heart with song, I’m singing for my Lord Everywhere I go. **Verse 3** I’m singing for the lost Just because I know Jesus Christ, whose precious blood Washes white as snow; If my songs to Him can bring Some lost soul I’ll gladly sing - I’m singing for my Lord Everywhere I go. **Verse 4** I’m singing, for the saints As they journey home; Soon they’ll reach the happy land Where they’ll never roam, And with me they’ll join and sing Praises to our Lord and King - I’m singing for my Lord Everywhere I go. _(J. Smith & R. Harper)_"},{"title":"When I've Run The Race Before Me","medlyFrom":0,"medlyTo":0,"href":"/english/31","content":"**Verse 1** When I’ve run the race before me, And have fought to victory, I’ll be raptured to the glory of the Lord. When I’ve kept the faith at any cost The Holy city then; I’ll receive as my reward. **Chorus 1** I’ll be raptured into glory In the Holy City dwell – New Jerusalem, New Jerusalem. With the overcomers shouting; How our praises then will swell, In the New Jerusalem. **Verse 2** As a pilgrim here I wander; While afflicted, I rejoice; For a better land I soon expect to see. Though all others seek for earthly gain, The Holy City e’er Will my aspiration be. **Verse 3** Though my feet are often wearied On the rough and rugged path, Just by thinking of that City, I’m restored; Though my eyes be filled with tears, My heart will evermore be fixed On that City, my reward. **Verse 4** With strong purpose I now wrestle, And I run toward the goal; I pursue the prize, God’s highest to obtain; Pressing forward toward the mark, I run forgetting all behind, Thus the Holy City gain. (Chorus 2) **Chorus 2** By His love and through His grace I’ll In the Holy City live – New Jerusalem, New Jerusalem; All saints leaping, singing, shouting To the Lord their praises give, In the New Jerusalem."},{"title":"This World Is Not My Home","medlyFrom":0,"medlyTo":0,"href":"/english/32","content":"This world is not my home I’m just a-passing through My treasures are laid up Somewhere beyond the blue The angels beckon me from heaven’s open door And I can’t feel at home in this world any more. Oh Lord, You know I have no friend like You. If heaven’s not my home, then Lord, what will I do? The angels beckon me from heaven’s open door, And I can’t feel at home in this world anymore."},{"title":"I Know Who Holds Tomorrow","medlyFrom":0,"medlyTo":0,"href":"/english/33","content":"**Verse 1** I don’t know about tomorrow, I just live from day to day; I don’t borrow from its sunshine, For its skies may turn to gray; I don’t worry o’er the future, For I know what Jesus said, And today I’ll walk beside Him, For He knows what is ahead. **Chorus** Many things about tomorrow I don’t seem to understand; But I know who holds tomorrow, And I know who holds my hand. **Verse 2** I don’t know about tomorrow, It may bring me poverty; But the One who feeds the sparrow, Is the One who stands by me. And the path that be my portion, May be through the flame or flood, But His presence goes before me, And I’m covered with His blood. **Verse 3** Every step is getting brighter As the golden stairs I climb; Every burden’s getting lighter, Every cloud is silver lined. There the sun is always shining, There no tear will dim the eye; At the ending of the rainbow, Where the mountains touch the sky. _(Ira F. Stanphill)_"},{"title":"Unto Thee O Lord","medlyFrom":0,"medlyTo":0,"href":"/english/34","content":"**Verse 1** Unto Thee, O Lord, do I lift up my soul. (2x) **Chorus** O my God, I trust in Thee Let me not be ashamed, Let not my enemies triumph over me. **Verse 2** Yea, let none that wait, in Thee, be ashamed. (2x) **Verse 3** Show me Thy ways, teach me Thy paths. (2x) **Verse 4** Remember not the sins of my youth. (2x) **Verse 5** All the paths of the Lord are mercy and truth. (2x) **Verse 6** What man is he that feareth the Lord. (2x) **Verse 7** The secret of the Lord, is with them that fear Him. (2x) **Verse 8** Turn Thee unto me and have mercy upon me. (2x) _(Composer unknown/Ref: Psalm 25)_"},{"title":"He Cares For Me","medlyFrom":0,"medlyTo":0,"href":"/english/35","content":"**Verse 1** Our God is far greater than words can make known. Exalted and Holy, He reigns on His throne, In infinite splendor He rules over all. Yet He feeds the poor sparrows, and He knows when they fall. **Chorus** His power is great and will ever endure. His wisdom is peaceable, gentle and pure. But greater than all these glories I see, Is the glorious promise that He cares for me. **Verse 2** He rides the wild heavens, He strides to the sea. The high mountain trembles to hear His decree. His voice with great thundering sounds from above. But to His own dear children, He whispers His love _(Jimmy Owens)_"},{"title":"Jesus, Stand Among Us","medlyFrom":0,"medlyTo":0,"href":"/english/36","content":"**Verse 1** Jesus, stand among us at the meeting of our lives. Be our sweet agreement at the meeting of our eyes. **Chorus** O Jesus, we love You, so we gather here. Join our hearts in unity and take away our fear. **Verse 2** So to You we're gathering out of each and every land, Christ, the love between us at the joining of our hands. _(Graham Kendrick)_"},{"title":"Where Your Heart Is","medlyFrom":0,"medlyTo":0,"href":"/english/37","content":"**Chorus** I guess it all comes down to where your heart is. It's there your thoughts and feelings all begin, But if you never give your heart to Jesus, You'll never really have a part in Him. **Verse 1** If your treasures are in heaven, Then your heart will be there too, And the things you say and do Will show Christ's love. But if your treasures here on earth, Tell me where your heart will be, You'll never have a part in things above. **Verse 2** If your mind's set on the Spirit, And you're walking in God's light, Then the watching world will see Christ's love in you. But if your mind's set on the earth, And the earthly things to do, In poverty you'll live your whole life through. _(Jon Sherberg / Ref: Romans 8:5)_"},{"title":"I Worship You, Almighty God","medlyFrom":0,"medlyTo":0,"href":"/english/38","content":"I worship You, Almighty God, There is none like You. I worship You, O Prince of Peace, That is what I want to do. I give You praise, for You are my righteousness; I worship You, Almighty God, There is none like You. _(Sondra Corbett)_"},{"title":"You Are The King Of Glory","medlyFrom":0,"medlyTo":0,"href":"/english/39","content":"You are the Prince of Peace. You are the Lord of heaven and earth. You’re the Son of righteousness. Angels bow down before You, Worship and adore, for You have the words of eternal life. You are Jesus Christ, the Lord. Hosanna to the Son of David! Hosanna to the King of Kings! Glory in the highest heaven for Jesus, the Messiah reigns! _(Mavis Ford)_"},{"title":"Reach Out To Jesus","medlyFrom":0,"medlyTo":0,"href":"/english/40","content":"**Verse 1** Is your burden heavy as you bear it all alone? Does the road you travel Harbour danger yet unknown? Are you growing weary in the struggle of it all? Jesus will help you when on His name you call. **Chorus** He is always there, hearing every prayer, Faithful and true; Walking by our side, in His love we hide All the day through. When you get discouraged, Just remember what to do Reach out to Jesus, He's reaching out to you. **Verse 2** Is the life you're living filled with sorrow and despair? Does the future press you with its worries and its cares? Are you tired and friendless? Have you almost lost your way? Jesus will help you, just come to Him today. _(R. Carmichael)_"},{"title":"Thank You Lord","medlyFrom":0,"medlyTo":0,"href":"/english/41","content":"**Verse 1** I thank You, Lord, For the trials that come my way, In that way I can grow each day, As I let You lead; And I thank You Lord, For the patience those trials bring, In the process of growing, I can learn to care. **Chorus** But it goes against the way I am, To put my human nature down, And let the Spirit take control, of all I do; 'Cause when those trials come, My human nature shouts the things to do, And God's soft prompting can be easily ignored **Verse 2** But I thank You, Lord, With each trial I feel inside; That You're there to help, lead and guide Me away from wrong; 'Cause You’ve promised, Lord, That with every testing, That Your way of escaping is easier to bear. **Verse 3** Yes, I thank You, Lord, For the vict'ry that growing brings In surrender of everything, Life is so worthwhile; And I thank You, Lord, That when everything's put in place, Out in front I can see Your face And it's there You belong. _(Dan Burges)_"},{"title":"If You're Feeling Lonely With Many A Care","medlyFrom":0,"medlyTo":0,"href":"/english/42","content":"**Verse 1** If you're feeling lonely with many a care, Jesus, Jesus, Jesus is there! If trouble, confusion puts your life in night, Jesus, Jesus, Jesus is Light! **Chorus 1** If you turn to Him, From within, Burdens He'll share; It matters not who you are, Jesus is there. **Verse 2** So don't wait for answers from some place, somehow; Jesus, Jesus, Jesus is Now! **Chorus 2** If you call on Him, From within, You just can't miss! And when problems torment you, Just remember this: In all situations this world can afford, Jesus, Jesus, Jesus is Lord!"},{"title":"My Living Sacrifice","medlyFrom":0,"medlyTo":0,"href":"/english/43","content":"**Verse 1** My heart longs for You, my Saviour. I would follow You, my Lord. Your kindness and love are vast as the skies. Your faithfulness never dies. My God and my King, Your great name I sing. My off'ring of praise I bring. **Chorus** Jesus, O Jesus, I give You my life. Jesus, O Jesus, I give You my life. continue next page **Verse 2** My soul contemplates Your glory. I worship in holy awe. In quietness and in confident trust, I rest in all that You are. I'll sing to the world Your glory and grace Until I behold Your face. _(Leila Hamrat & Claude Fraysse)_"},{"title":"A Common Love For Each Other","medlyFrom":0,"medlyTo":0,"href":"/english/44","content":"**Chorus** A common love for each other, A common gift to the Savior, A common bond holding us to the Lord. A common strength when we’re weary, A common hope for tomorrow, A common joy in the truth of God’s Word. **Verse 1** In His family, we can meet each one’s needs, We can light each one’s path, We can bear each one’s grief. As His children, We can comfort each care, We can build each one’s faith, We can work, we can share. **Verse 2** In His family, all the love that we show, All the help that we give, All the life we bestow, As His children, They’re an off’ring we make, Not expecting return, Just a gift for His sake. _(C.F. Brown / Ref: Romans 12:4–16)_"},{"title":"Father, I Thank You","medlyFrom":0,"medlyTo":0,"href":"/english/45","content":"**Verse 1** Father, I thank You for all that You've done. You gave Your Son freely for me. And I praise You for calling me, drawing me near. Out of blindness You caused me to see. **Verse 2** Spirit of life, You are God's holy fire. You've kindled my heart with Your blaze. And I know You're refining me, changing my life. And by faith You're revealing Your ways. **Verse 3** Jesus, I need You as Lord of my life. I give all I have unto You. Lord, I want to come under Your heavenly hand, And to praise You in all that I do. _(Steven Stewart)_"},{"title":"Give Thanks","medlyFrom":0,"medlyTo":0,"href":"/english/46","content":"**Verse** Give thanks with a grateful heart. Give thanks to the Holy One. Give thanks because He’s given Jesus Christ, His Son. **(Repeat Verse)** **Chorus** And now let the weak say, “I am strong”, Let the poor say, “I am rich”, Because of what the Lord has done for us. And now let the weak say, “I am strong”, Let the poor say, “I am rich”, Because of what the Lord has done for us. Give thanks. _(Henry Smith)_"},{"title":"The Lily Of The Valley","medlyFrom":0,"medlyTo":0,"href":"/english/47","content":"**Verse 1** I’ve found a friend in Jesus, He’s everything to me, He’s the fairest of ten thousand to my soul; The Apple-tree of trees, in Him alone I see All I need to cleanse and make me fully whole. In sorrow He’s my comfort, In trouble He’s my stay, He tells me every care on Him to roll: He’s the Apple-tree of trees, The Bright and Morning Star, He’s the fairest of ten thousand to my soul. **Verse 2** He all my grief has taken, And all my sorrows borne; In temptation He’s my strong and mighty tower; I’ve all for Him forsaken, and all my idols torn From my heart, and now He keep me by His power. Though all the world forsake me, And Satan tempt me sore, Through Jesus I shall safely reach the goal: He’s the Apple-tree of trees, The Bright and Morning Star, He’s the fairest of ten thousand to my soul. **Verse 3** He’ll never, never leave me, nor yet forsake me here, While I live by faith and do His blessed will; A wall of fire about me, I’ve nothing now to fear, With His manna He my hungry soul shall fill. Then sweeping up to glory To see His blessed face, Where rivers of delight shall ever roll: He’s the Apple-tree of trees, The Bright and Morning Star, He’s the fairest of ten thousand to my soul."},{"title":"Step By Step","medlyFrom":0,"medlyTo":0,"href":"/english/48","content":"**Verse 1** ‘Tis so sweet to walk with Jesus, Step by step and day by day; Stepping in His very footprints, Walking with Him all the way. **Chorus** Step by step, step by step, I would walk with Jesus, All the day, all the way, Keeping step with Jesus. **Verse 2** ‘Tis so safe to walk with Jesus, Leaning hard upon His arm, Following closely where He leads us, None can hurt and naught can harm. **Verse 3** Step by step I’ll walk with Jesus, Just a moment at a time, Heights I have not wings to soar to, Step by step my feet can climb. **Verse 4** All the way I’ll walk with Jesus, Through the sunshine, through the gloom, Though His blood-marked steps may lead me To the garden, to the tomb. **Verse 5** Here a while we walk with Jesus, But the time will not be long Till the night shall change to morning, And the sorrow into song. **Verse 6** Then, with all who walked with Jesus, We shall walk with Him in white, While He turns our grief to gladness, And our darkness into light. **Verse 7** Jesus, keep me closer – closer, Step by step, and day by day; Stepping in Thy very footprints, Walking with Thee all the way. _(Albert B. Simpson)_"},{"title":"How Excellent Your Name","medlyFrom":0,"medlyTo":0,"href":"/english/49","content":"**Verse** Oh Lord, our Lord, How excellent Your name is. How excellent Your name in all the earth. Your glory fills the heavens beyond the furthest star. How excellent Your name in all the earth. **Chorus** When I think about the heavens, The moon and all the stars, I wonder what You ever saw in me; But You took me and You loved me, And You’ve given me a crown. And now I’ll praise Your name eternally. **(Repeat Verse)** _(Peter Jacobs / Ref: Psalm 8)_"},{"title":"He Is My Peace","medlyFrom":0,"medlyTo":0,"href":"/english/50","content":"**Verse** He is my peace, who has broken down every wall. He is my peace, He is my peace. He is my peace, who has broken down every wall. He is my peace, He is my peace. **Chorus** Cast all your care on Him, For He careth for you. He is my peace, He is my peace. Cast all your care on Him, For He careth for you. He is my peace, He is my peace. _(Kandy Groves/Ref: Ephesians 2:14; 1 Peter 5:7)_"}],"chinese":[]}